{
  "id": "scorpion-scp-1n",
  "chassis": "Scorpion",
  "model": "SCP-1N",
  "unitType": "BattleMech",
  "configuration": "Quad",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "STANDARD",
  "era": "AGE_OF_WAR",
  "year": 2570,
  "tonnage": 55,
  "engine": {
    "type": "FUSION",
    "rating": 330
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "FLL": 10,
      "FRL": 10,
      "LEFT_TORSO": {
        "front": 11,
        "rear": 5
      },
      "RIGHT_TORSO": {
        "front": 11,
        "rear": 5
      },
      "CENTER_TORSO": {
        "front": 24,
        "rear": 8
      },
      "HEAD": 8,
      "RLL": 10,
      "RRL": 10
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 10
  },
  "movement": {
    "walk": 6,
    "jump": 0
  },
  "equipment": [
    {
      "id": "ppc",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "srm-6",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_TORSO": [
      "IS Ammo SRM-6",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "PPC",
      "PPC",
      "PPC",
      "SRM 6",
      "SRM 6",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      null,
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ]
  },
  "quirks": [
    "bad_rep_clan",
    "bad_rep_is",
    "hard_pilot"
  ],
  "fluff": {
    "overview": "Every company has their beginnings. Many know Brigadier Corporation as one of the industrial powerhouses of the Free Worlds League. But at first, Brigadier was little more than a contract manufacturer for existing Hegemony designs. Ambition—along with a healthy lust for profits—would eventually spurn Brigadier to lunge towards manufacturing their own in-house designs, which would be boldly launched with the Scorpion: a quad BattleMech. Though Dr. Harrison, a strong proponent for quad designs, claimed that his new Scorpion would revolutionize 'Mech warfare, the Scorpion turned out to be barely more than a boondoggle. Sales were low, and few mourned the loss of the main factory on Oliver when it was destroyed in 2837.",
    "capabilities": "The Scorpion is typically armed with a reliable one-two weapon combination. A primary large energy weapon or autocannon opens up holes, while a missile weapon usually takes advantage of any exposed weaknesses. While powerful in theory, in practice the Scorpion mounts barely more firepower than 'Mechs twenty tons lighter. With armor coverage barely better than some light 'Mechs, a badly positioned Scorpion is easy prey for better-armed BattleMechs. Combined with the bucking, bumpy ride the Scorpion has to offer, few choose to voluntarily pilot the design.",
    "deployment": "Scorpions can be found throughout every part of the Inner Sphere. They are not a common design, and the limitations of the Succession Wars lead many Successor States to neglect their Scorpions in favor of better, more reliable designs. Upgrade kits would eventually appear with the discovery of the Helm Core, which gradually lead to the base SCP-1N Scorpion remaining solely in the hands of poorer nations or mercenary commands.",
    "systemManufacturer": {
      "CHASSIS": "Brigadier",
      "ENGINE": "Vox",
      "ARMOR": "StarSlab",
      "COMMUNICATIONS": "Garret",
      "TARGETING": "Garret"
    }
  },
  "mulId": 2837,
  "role": "Skirmisher",
  "source": "TR:3039"
}