{
  "id": "thorn-the-f",
  "chassis": "Thorn",
  "model": "THE-F",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "STANDARD",
  "era": "AGE_OF_WAR",
  "year": 2490,
  "tonnage": 20,
  "engine": {
    "type": "FUSION",
    "rating": 120
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 6,
      "RIGHT_ARM": 6,
      "LEFT_TORSO": {
        "front": 6,
        "rear": 3
      },
      "RIGHT_TORSO": {
        "front": 6,
        "rear": 3
      },
      "CENTER_TORSO": {
        "front": 8,
        "rear": 4
      },
      "HEAD": 8,
      "LEFT_LEG": 7,
      "RIGHT_LEG": 7
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 10
  },
  "movement": {
    "walk": 6,
    "jump": 0
  },
  "equipment": [
    {
      "id": "medium-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "lrm-5",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-laser",
      "location": "HEAD"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Medium Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "LRM 5",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Heat Sink",
      "Heat Sink",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Heat Sink",
      "Heat Sink",
      "IS Ammo LRM-5",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Heat Sink",
      "Heat Sink"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Medium Laser",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "easy_maintain"
  ],
  "fluff": {
    "overview": "The Thorn is a light BattleMech which was originally intended to operate as a scout.",
    "capabilities": "Four and a half tons of armor provides the Thorn with good protection, especially when mated with CASE to contain any ammunition explosions. The use of an Endo Steel chassis is what allows the Thorn to carry all of this equipment, an alloy twice as strong as standard materials if somewhat bulky. The GM 120 fusion engine gives the Thorn a respectable cruising speed of 65 km/h but the lack of jump jets further compounds its issues with catching other light 'Mechs. Built with the standard number of ten engine-mounted heat sinks the Thorn is regarded as a \"cool running\" design, although the placement of the head laser right below the cockpit (despite additional cooling systems) makes repeated firings uncomfortable.",
    "history": "When the 'Mech first debuted for the Hegemony Armed Forces in the twenty-fifth century, it was with a great deal of hype that unfortunately the Thorn could never truly match. Critics who look at the 'Mech generally see it in one of two ways: as a light 'Mech that is not fast enough for its own good or a light 'Mech that tries to do a job only a heavier 'Mech should. Looking at the Thorn with neither bias, it is easy to see where these two viewpoints come from. The Thorn is too slow to function in the traditional light 'Mech role of scouting and it does not have the armor or staying power of heavier machines. Facing competition from the Locust it was only when Ford Military Limited decided in 2549 to rebuild the Thorn with the very latest in technology, including the first-ever use of an Endo Steel chassis and Cellular Ammunition Storage Equipment, that the HAF renewed their interest. Once in service the Thorn found its niche as a light 'Mech hunter and infantry support platform. As supporters quickly pointed out the Thorn was ton-for-ton superior to most other light 'Mechs in terms of combat power and could reduce an opponent of similar weight to scrap in minutes. This aspect made it very popular for light 'Mech companies expecting heavy fighting and infantry in need of fire support. The Thorn continued to serve following the creation of the Star League Defense Force and often fought alongside the likes of similar designs such as Hoplites and Hussars. Unfortunately the reliance on advanced technology doomed the Thorn when the Star League dissolved and the Succession Wars began. With the orbital manufacturing centers necessary for Endo Steel production destroyed by the time of the Second Succession War, it became impossible to maintain what Thorns the Great Houses inherited in their original condition. Ford Military was forced to produce the original downgraded version in an attempt to keep the line going, but sporadic production barely kept it alive and by the time the Succession Wars were over the original Thorn could only be found in service to the Com Guards. When ComStar decided to supply the Draconis Combine as part of Operation ROSEBUD the Thorn was among those Star League-era 'Mechs gifted to the DCMS, albeit with all of its advanced technology stripped out. That this necessitate the quite radical approach of rebuilding the 'Mech from the ground-up with a standard chassis only highlighted the lengths ComStar would go to in order to maintain its monopoly on lostech. When the Clans invaded it was discovered they had also maintained the Thorn in large numbers, although most were still stored in Brian Caches and reserved for use by solahma troops. The invasion also forced ComStar to begin a hasty rearmament program that included the development of a new variant, the THE-N1. Following the ComStar Schism the Word of Blake was able to seize Terra for themselves and direct the Thorn production line to equip their own military forces for the coming Jihad.",
    "deployment": "The original pre-Endo Steel model introduced in 2490, the THE-F was replaced with the THE-N model, although during the Succession Wars when the advanced systems of the THE-N were lost sporadic production of this variant was restarted. ComStar used its blueprints to produce the downgraded THE-S factory refit, and save for different sub-system components, both are functionally identical.",
    "manufacturer": "Ford Military Limited",
    "primaryFactory": "Terra",
    "systemManufacturer": {
      "CHASSIS": "Chariot Type II",
      "ENGINE": "GM 120",
      "ARMOR": "Armorscale",
      "COMMUNICATIONS": "Opus I Ultrabeam",
      "TARGETING": "Orion 80"
    }
  },
  "mulId": 3190,
  "role": "Striker",
  "source": "TR:3039"
}