{
  "id": "orion-on1-k-kerensky",
  "chassis": "Orion",
  "model": "ON1-K (Kerensky)",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "STAR_LEAGUE",
  "year": 2753,
  "tonnage": 75,
  "engine": {
    "type": "FUSION",
    "rating": 300
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "FERRO_FIBROUS",
    "allocation": {
      "LEFT_ARM": 24,
      "RIGHT_ARM": 24,
      "LEFT_TORSO": {
        "front": 22,
        "rear": 10
      },
      "RIGHT_TORSO": {
        "front": 22,
        "rear": 10
      },
      "CENTER_TORSO": {
        "front": 36,
        "rear": 10
      },
      "HEAD": 9,
      "LEFT_LEG": 32,
      "RIGHT_LEG": 32
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 10
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "medium-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "medium-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "snub-nose-ppc",
      "location": "LEFT_TORSO"
    },
    {
      "id": "srm-4",
      "location": "LEFT_TORSO"
    },
    {
      "id": "gauss-rifle",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Medium Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Medium Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "ISSNPPC",
      "ISSNPPC",
      "SRM 4",
      "ISArtemisIV",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous"
    ],
    "RIGHT_TORSO": [
      "ISCASE",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "IS Gauss Ammo",
      "IS Gauss Ammo",
      "IS Ammo SRM-4 Artemis-capable",
      "IS Ferro-Fibrous"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "IS Ferro-Fibrous",
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous"
    ]
  },
  "quirks": [
    "anti_air",
    "easy_maintain",
    "rugged_1"
  ],
  "fluff": {
    "overview": "The Orion was built in 2456 as the first true heavy BattleMech. Originally designed for the Terran Hegemony to maintain its dominance and built on Hesperus II.",
    "capabilities": "The Orion is a dependable workhorse design that can handle almost any combat role, thanks to its mix of long and short-range weaponry and its respectable armoring.",
    "history": "After the K model was introduced in 2525 the 'Mech first saw combat during the Reunification War and continued to serve the Star League and its Member States for the next few centuries. Perhaps its most famous role was as the personal 'Mech of Aleksandr Kerensky during the Amaris Civil War, and it was while piloting his Orion that the general kicked down the palace doors to take the Usurper prisoner. The inspiration for the Orion's beginnings is said to be a direct result of Operation Prometheus when the Terran Hegemony realized they would no longer be the sole user of BattleMechs. Work began shortly after with the HAF requesting machines suited for various combat roles and the Hegemony's military leadership were soon accepting proposals for competing designs almost simultaneously. With other designs already underway, it would be General Mechanics winning a contract for a proposal that would ultimately become the Hegemony's premier heavy attack BattleMech: the Orion. Ironically, GM had actually unveiled a prototype as early as 2453, but the HAF, while interested at the time, were dismissive as it did not meet the High Command's requirements for speed and armor, and its armament was considered too lackluster for a front-line war machine. GM had returned to the drawing board in the following years, further refining their design by settling for a smaller, less powerful engine to free up weight for additional weaponry. It would not be until GM's third prototype - the ON1-H which mounted a newly developed class-10 heavy autocannon, that the HAF would finally approve the design one year following Operation Prometheus in 2456. Following the successful introduction of the prototype, the HAF immediately pushed General Mechanics to produce as many Orions as possible. The armed forces of the Hegemony quickly assigned them to BattleMech regiments in whole companies at a time, adding to their growing ranks of Mackies, Banshees, and later Archers and Griffins. After the fall of the Star League, Kali Yama Weapons Industries took over production of the Orion, building new models from their factories on Kalidasa. This left the Free Worlds League as the only producer of new Orions during the Succession Wars, although the other Successor States were capable of building spare parts to repair their 'Mechs, and meant the Free Worlds League Military was the largest Orion user. When Kali Yama merged to create the Kali Yama - Alphard Trading Corporation Orion production was started up on Kendall as well. The League's dominance in new Orions began to change during the Clan Invasion when the Successor States met on Outreach and agreed to work together to combat the Clans. Kali Yama/ATC was among those companies which agreed to sell war materiel, including the Orion, to the other States undergoing Clan attacks. In spite of the design's age it still finds itself utilized extensively on the modern battlefield and new variants continue to be produced",
    "deployment": "The personal BattleMech of Commanding General Aleksandr Kerensky during the war against the Usurper. Designers removed the LRM-15 and Autocannon/10 to make room for other equipment, adding an experimental Snub-Nose PPC in the left torso and an Artemis IV Fire Control System for the SRMs. The right torso has a Gauss Rifle in the former location of the autocannon. The medium lasers from the original model are retained. Finally, ferro-fibrous armor and CASE are used for added protection.",
    "manufacturer": "Field Refit",
    "primaryFactory": "Field Refit",
    "systemManufacturer": {
      "CHASSIS": "KaliYama Chassis",
      "ENGINE": "Vlar 300",
      "ARMOR": "Valiant Lamellor",
      "COMMUNICATIONS": "Irian Orator-5K",
      "TARGETING": "Irian Orator-5K"
    }
  },
  "mulId": 2333,
  "role": "Brawler",
  "source": "TR:3050"
}