{
  "id": "zeus-x-zeu-x",
  "chassis": "Zeus-X",
  "model": "ZEU-X",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "UNOFFICIAL",
  "era": "CLAN_INVASION",
  "year": 3054,
  "tonnage": 80,
  "engine": {
    "type": "XXL",
    "rating": 400
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "COMPOSITE"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {}
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 12
  },
  "movement": {
    "walk": 5,
    "jump": 0
  },
  "equipment": [
    {
      "id": "medium-x-pulse-laser",
      "location": "CENTER_TORSO"
    },
    {
      "id": "medium-x-pulse-laser",
      "location": "CENTER_TORSO"
    },
    {
      "id": "mrm-30",
      "location": "RIGHT_ARM"
    },
    {
      "id": "lb-20-x-ac",
      "location": "LEFT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "IS Reactive",
      "IS Reactive",
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "MRM 30",
      "MRM 30",
      "MRM 30",
      "MRM 30",
      "MRM 30",
      "IS Reactive",
      "IS Reactive",
      null,
      null
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISMediumXPulseLaser"
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "IS LB 20-X AC Ammo",
      "IS LB 20-X AC Ammo",
      "IS LB 20-X Cluster Ammo",
      "IS MRM 30 Ammo",
      "IS MRM 30 Ammo",
      "ISCASEII"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISMediumXPulseLaser",
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Reactive",
      "IS Reactive"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Reactive",
      "IS Reactive"
    ]
  },
  "quirks": [
    "command_mech",
    "difficult_maintain"
  ],
  "fluff": {
    "overview": "The original ZEU-X was a technological milestone. It was also an unwieldy mess of patchwork armor, reactive composites, and illogical short-range weapons, the limited manufacturing of which during the Civil War functioned only as propaganda. The following model was a massive failure, as the marriage of armored components and composite structure frequently ended in a pile of intact internal components as the only remains of a defeated ZEU-X2. A 3080s model was an inefficient jumping monster informed by Solaris research on the enigmatic Sasquatch. Only the sub-variant ZEU-WD series, which combined X-series improvements with conventional Zeus chassis, was a success.",
    "capabilities": "Manufactured on by Defiance, the Zeus X was both a poster child for excellence in production engineering and an innovative high-technology platform, while at the same time struggling with emerging technologies.",
    "history": "The Zeus personifies Steiner's \"wall of steel.\" The LCAF's indigenous pride and joy was reportedly the ultimate demonstration that superior production quality could compensate for weak battlefield prowess. It was picked for a facelift after three centuries of steadfast service to demonstrate Defiance's reputation as one of the Inner Sphere's major manufacturers. The Zeus X is equal parts celebrity and cutting-edge high-tech platform. Its modifications bring the ancient BattleMech up to date, even by thirty-second-century standards. The Zeus X-series is characterised structurally by a massive engine and a light yet brittle structure coated in layers of experimental armor. These qualities were carefully integrated with appropriate equipment when the ZEU-X4 was ready for manufacturing in the late 3110. The thick reactive plating is now production quality and completely covers the 'Mech. The LCAF received a command 'Mech when a roomy rumble seat was upgraded to a full console. Armed with modest but effective weapons, the ZEU-X4 attacks foes who are nothing more than approaching blots on the horizon. end of the Third Succession War, with the resulting ZEU-6T variant being the standard during the Fourth Succession War and later the War of 3039. The design was also well received by mercenary units, particularly the Zeta Battalion of Wolf's Dragoons.",
    "deployment": "The first of what became commonly referred to as the Zeus X series, the ZEU-X was a variant of the venerable Zeus BattleMech developed during the Clan Invasion that used Experimental Technology to push the envelope of the original Zeus design. The 'Mech was built using a Composite chassis which weighed half as much as a regular chassis, but was only half as strong as a normal internal structure. The 'Mech was also armored with both normal armor and Reactive Armor on its limbs. The 'Mech was armed with an LB-X Autocannon/20 as its primary weapon, backed up by an MRM 30 launcher. The ZEU-X carried three tons of ammunition for the LB-X AC/20 and two tons for the MRM 30, stored in the right torso and protected by CASE II. For close combat, the Zeus had two Medium X-Pulse Lasers. Finally, for added speed, the 'Mech was built using an XXL engine which weighed only seventeen and a half tons, giving the 'Mech a maximum speed of 86 km/h, and carried a dozen Double Heat Sinks. The ZEU-X was the most heavily armored of the Zeus X variants to enter service prior to the Blackout, mounting a full fifteen and a half tons of armor.",
    "manufacturer": "Defiance Industries",
    "primaryFactory": "Hesperus II",
    "systemManufacturer": {
      "CHASSIS": "Chariot III Ultralight Composite",
      "ENGINE": "Defiance 400 XXL",
      "ARMOR": "Valiant Lamellor/Durallex Shockwave Reactive with CASE II",
      "COMMUNICATIONS": "TharHes Calliope ZE-5A2",
      "TARGETING": "TharHes Ares-X9-B"
    }
  },
  "mulId": 6631,
  "role": "Skirmisher",
  "source": "TR:3145:LC"
}