{
  "id": "awesome-aws-8q-buck",
  "chassis": "Awesome",
  "model": "AWS-8Q (Buck)",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CIVIL_WAR",
  "year": 3076,
  "tonnage": 80,
  "engine": {
    "type": "XL",
    "rating": 400
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "FERRO_FIBROUS",
    "allocation": {
      "LEFT_ARM": 25,
      "RIGHT_ARM": 25,
      "LEFT_TORSO": {
        "front": 24,
        "rear": 10
      },
      "RIGHT_TORSO": {
        "front": 24,
        "rear": 10
      },
      "CENTER_TORSO": {
        "front": 33,
        "rear": 15
      },
      "HEAD": 9,
      "LEFT_LEG": 33,
      "RIGHT_LEG": 33
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 16
  },
  "movement": {
    "walk": 5,
    "jump": 0
  },
  "equipment": [
    {
      "id": "ppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "ppc",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "ppc",
      "location": "LEFT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "PPC",
      "PPC",
      "PPC",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "PPC",
      "PPC",
      "PPC",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "PPC",
      "PPC",
      "PPC",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous",
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "IS Ferro-Fibrous",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Ferro-Fibrous",
      "IS Ferro-Fibrous"
    ]
  },
  "quirks": [
    "battle_fists_la"
  ],
  "fluff": {
    "overview": "The Awesome was designed in 2665 for the Star League by the Technicron Conglomorate and was based on the aging STR-2C Striker. While not as fast as its forefather, the Awesome is a strong assault 'Mech.",
    "capabilities": "The Awesome's abilities are nearly entirely dependent on its particle projection cannons. The AWS can withstand a severe and consistent onslaught from its weaponry thanks to several heat sinks. With one and a half tons more armor than the Striker, the AWS is more protected than even the BattleMaster. The Awesome, like any other BattleMech, has weaknesses. While it is lethal at range, it is less effective in close-quarters combat since its PPCs have a tougher time connecting with the victim. In that case, it just possesses a light weapon and a left fist to fall back on. Because of its limited mobility, it is vulnerable to flanking attacks from speedier opponents seeking to get past the PPCs. While they face arguably of the heaviest rear armor found on any BattleMech, the Awesome's lack of rear facing armaments or a weapon mount on its left arm has offered numerous MechWarriors a fighting chance. Formations of Awesomes (or even just a few) are incredibly effective and tough to stop or defeat when correctly placed by commanders who are knowledgeable of the AWS's limitations.",
    "history": "Awesomes can be found in every military House. Because the Free Worlds League has the last remaining manufacturing factories capable of generating the Awesome, it also has the most Awesomes of any of the Great Houses. Opinions on the 'Mech vary greatly within the League. Many people laud its powers, while others believe that its limited mobility is too high a price to pay for what it can do. Similar sentiments exist in the other Houses, but none of them can debate the issue beyond academics. Few commanders would turn down the opportunity to acquire an Awesome for their army. The Awesome is typically used to assault a fixed position or to breach the enemy's line of defense. They are also in demand for defensive operations. MechWarriors piloting the Awesome can expect to be involved in heavy battle and to be charged with obtaining or guarding the most crucial objectives from the adversary.",
    "deployment": "This standard Awesome was modified by Major Buck Tripp of The Thumpers. It carries the standard three PPCs of the Awesome-8Q, but uses an XL Gyro and larger XL engine to reach a maximum speed of 84 km/h. It removes twelve heat sinks and upgrades the remaining sixteen to double strength models. It also removes the small laser and standard armor, instead using thirteen and a half tons of Ferro-Fibrous armor to provide protection.",
    "manufacturer": "Field Refit",
    "primaryFactory": "Various",
    "systemManufacturer": {
      "CHASSIS": "Technicron Type G",
      "ENGINE": "Pitban 400 XL",
      "ARMOR": "Durallex Super Medium",
      "COMMUNICATIONS": "Garrett T19-G",
      "TARGETING": "Dynatec 2780"
    }
  },
  "mulId": 7311,
  "role": "Sniper",
  "source": "HTP:Tortuga"
}