{
  "id": "jabberwocky-jaw-65a-engineermech",
  "chassis": "Jabberwocky",
  "model": "JAW-65A EngineerMech",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "AGE_OF_WAR",
  "year": 2549,
  "tonnage": 50,
  "engine": {
    "type": "FUEL_CELL",
    "rating": 150
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "INDUSTRIAL"
  },
  "armor": {
    "type": "INDUSTRIAL",
    "allocation": {
      "LEFT_ARM": 3,
      "RIGHT_ARM": 3,
      "LEFT_TORSO": {
        "front": 3,
        "rear": 1
      },
      "RIGHT_TORSO": {
        "front": 3,
        "rear": 1
      },
      "CENTER_TORSO": {
        "front": 5,
        "rear": 1
      },
      "HEAD": 4,
      "LEFT_LEG": 4,
      "RIGHT_LEG": 4
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 8
  },
  "movement": {
    "walk": 3,
    "jump": 0
  },
  "equipment": [],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Spot Welder",
      "Environmental Sealing",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Salvage Arm",
      "Salvage Arm",
      "Environmental Sealing",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Heat Sink",
      "Environmental Sealing",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Heat Sink",
      "Lift Hoist (R)",
      "Lift Hoist (R)",
      "Lift Hoist (R)",
      "Environmental Sealing",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Environmental Sealing",
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Environmental Sealing",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Tracks",
      "Environmental Sealing"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Tracks",
      "Environmental Sealing"
    ]
  },
  "fluff": {
    "overview": "<p>The JAW-66A Jabberwocky, originally developed in 2549 as a general military support unit, fell short of expectations and was relegated to less critical tasks. However, its fortunes changed dramatically by 3069 when the Federated Suns, amid widespread devastation, urgently mobilized every available armed machine for combat, including the Jabberwocky. In response to the dire need for fortified engineering units, Jalastar Aerospace took the initiative in 3070 to introduce a completely reworked Jabberwocky, transforming it into a versatile and efficient IndustrialMech.</p>",
    "capabilities": "<p>The JAW-66B Jabberwocky stands out for its simplicity in maintenance, thanks to its Panpour-produced components that are readily available. Unlike many IndustrialMechs, the Jabberwocky utilizes old neurohelmets, providing pilots with enhanced control over the 50-ton chassis. It is equipped with a salvage arm, spot welder, and a pair of Industrial-TSM powered lift hoists, allowing it to carry double its weight in salvage. The tracked propulsion system grants higher speed on paved surfaces, and its three jump jets add to its maneuverability in rough terrain. Additionally, its environmental sealing and searchlight make it suitable for operations in various hostile environments. The semi-modularity of the design, akin to the Mercury Mech rather than an OmniMech, allows for easy replacement of its rear torso or arms with different industrial equipment.</p>",
    "history": "<p>The Jabberwocky IndustrialMech, originally developed in 2549, has undergone a remarkable transformation from an underperforming military support unit to a critical asset in engineering and battlefield operations. Its journey from obscurity to prominence is closely intertwined with the shifting demands and challenges faced by the Federated Suns during periods of intense conflict.<p>Initially intended for general military support, the JAW-66A Jabberwocky's limitations led to its relegation to secondary roles. However, the widespread devastation of the Jihad in 3069 compelled the Federated Suns to mobilize all available resources, resurrecting the Jabberwocky from storage and support units for frontline deployment. This move stripped many engineering units of their equipment, leaving them struggling with massive fortification and reconstruction efforts.<p>In 3070, amidst these challenges, Jalastar Aerospace recognized an opportunity to expand its market and introduced a completely reworked Jabberwocky, tailored for versatility in battlefield salvage and engineering tasks. The redesign, featuring components produced on Panpour and a track propulsion system for enhanced mobility, quickly garnered attention. Orders for the new Jabberwocky surged, with both Federated Suns support units and mercenary groups seeking to replenish their ranks with this adaptable machine.<p>Today, the Jabberwocky IndustrialMech stands as a testament to innovative engineering and adaptability in the face of adversity. Its various configurations, from the initial JAW-65A to the more versatile JAW-66B and specialized variants like the \"Demolition\" and \"Construction\" models, highlight the Mech's journey from an overlooked unit to an indispensable tool in both military and civilian engineering operations. The Jabberwocky's evolution not only reflects the changing landscape of Mech technology but also exemplifies the resilience and ingenuity of those who operate and maintain these machines in the ever-evolving theater of war.</p>",
    "deployment": "<p>The original iteration of the Jabberwocky, the JAW-65A was designed during the Age of War. Its propulsion system relied on a fuel cell engine, a common choice in that era but one that limited its operational capabilities. The 65A model was equipped with considerably less armor compared to later models and lacked jump jet technology, making it less versatile in various terrain conditions. Over time, these limitations led to the model being phased out, with most units being scrapped within a few decades of their manufacture.</p>",
    "manufacturer": "Unknown",
    "primaryFactory": "Unknown",
    "systemManufacturer": {
      "CHASSIS": "Corean Model KL80 Industrial",
      "ENGINE": "GM 200",
      "ARMOR": "ArcShield Maxi Special (Industrial Heavy)",
      "COMMUNICATIONS": "O/P R Janxiir",
      "TARGETING": "Jal ConstrucTrak Mk I"
    }
  },
  "mulId": 4383,
  "role": "Juggernaut",
  "source": "TR:3075"
}