{
  "id": "black-knight-blk-nt-3b",
  "chassis": "Black Knight",
  "model": "BLK-NT-3B",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "EXPERIMENTAL",
  "era": "DARK_AGE",
  "year": 3100,
  "tonnage": 75,
  "engine": {
    "type": "XL",
    "rating": 375
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "ENDO_COMPOSITE"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 24,
      "RIGHT_ARM": 24,
      "LEFT_TORSO": {
        "front": 24,
        "rear": 8
      },
      "RIGHT_TORSO": {
        "front": 24,
        "rear": 8
      },
      "CENTER_TORSO": {
        "front": 35,
        "rear": 10
      },
      "HEAD": 9,
      "LEFT_LEG": 25,
      "RIGHT_LEG": 25
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 17
  },
  "movement": {
    "walk": 5,
    "jump": 0
  },
  "equipment": [
    {
      "id": "er-ppc",
      "location": "LEFT_ARM"
    },
    {
      "id": "er-ppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "small-laser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "small-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "small-pulse-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "small-pulse-laser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "er-small-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "er-small-laser",
      "location": "RIGHT_ARM"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISERSmallLaser",
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISERSmallLaser",
      "ISMediumShield",
      "ISMediumShield",
      "ISMediumShield",
      "ISMediumShield",
      "ISMediumShield"
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISSmallPulseLaser",
      "Small Laser",
      "IS Endo-Composite",
      "TSM",
      "TSM",
      "TSM"
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISSmallPulseLaser",
      "Small Laser",
      "IS Endo-Composite",
      "TSM",
      "TSM",
      "TSM"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      null,
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "IS Endo-Composite",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Endo-Composite",
      "IS Endo-Composite"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Endo-Composite",
      "IS Endo-Composite"
    ]
  },
  "quirks": [
    "command_mech"
  ],
  "fluff": {
    "overview": "The Black Knight was introduced in 2578 both as a front-line combatant and as a command BattleMech at the company and battalion level for the Star League Defense Force.",
    "capabilities": "Thirteen tons of armor protection on an Endo Steel frame allows the Black Knight to withstand significant punishment. The biggest disadvantage of the design is its challenging heat curve, though the fact that it mounts twenty heat sinks ensures that the Black Knight can still disperse a significant amount of heat produced by its weapons. However, if the 'Mech is involved in a prolonged combat situation, a less experienced MechWarrior who is not competent at heat management may be in trouble. The Black Knight's superior communications equipment allowed it to readily coordinate a whole company of 'Mechs at the same time, as well as link together the command frequencies of an entire parent regiment and connect with orbital support satellites. Improved construction materials provided the Black Knight with a light but sturdy chassis capable of carrying more weaponry and armor for less weight. With the type and amount of weapons carried by the 'Mech, the only challenge the Black Knight faces is heat management.",
    "history": "The Black Knight first debuted in the Reunification War when they were fielded by the 3rd Heavy Assault Regiment in combat with the Taurian Concordat; following its success it was soon adopted by I Corps and the rest of the SLDF. When the Star League collapsed, Kong Interstellar continued producing Black Knights until their Connaught orbital factory was destroyed in 2802. In 2809, Kong was able to restart their production line, but was no longer capable of producing many of the more advanced components found in the Black Knight. As a result, Kong was forced to design a downgraded version, the BL-7-KNT. Finally the Black Knight production line was permanently destroyed in a raid by the Capellan Confederation in 2820, reducing the company to producing low-grade spare parts and performing maintenance. During the Succession Wars many Black Knights fell into the hands of the Great Houses, although as the years progressed they were increasingly forced to repair them with inferior components and their numbers slowly decreased. Some were modified with a number of nonstandard components such as jump jets but few if any survived into the thirty-first century. ComStar's stockpiles of Star League 'Mechs included the Black Knight, which they found to be an excellent command unit for Level II and Level III units when the Com Guards were formed, but the very few Black Knights gifted to the Draconis Combine during Operation ROSEBUD was apparently the result of a clerical error. For their part the Clans maintained the Black Knight, although by the time of the Clan Invasion it was reserved for solahma units. The Black Knight was one of several Clanbusters put together by ComStar leading up to the Battle of Tukayyid, and in 3063 Robinson Standard BattleWorks secured a license from Kong Interstellar to build a new variant, the BL-12-KNT. Two years later KIC finished rebuilding their plant and began producing Black Knights of their own.",
    "deployment": "This version uses the same Endo-Composite skeleton and XL engine of the 3A variant. Its weapons array has been modified however. Keeping the right arm mounted Medium Shield, this variant carries twin ER PPCs, two ER Small Lasers, twin Small Pulse Lasers, and a pair of Small Lasers. This version has also been equipped with seventeen double heat sinks. For increased speed and strength, the 3B version uses Triple Strength Myomer.",
    "manufacturer": "Robinson Standard BattleWorks",
    "primaryFactory": "Robinson",
    "systemManufacturer": {
      "CHASSIS": "Technicron Revised NT Endo-Composite",
      "ENGINE": "Vlar 375 XL",
      "ARMOR": "Valiant Lamellor",
      "COMMUNICATIONS": "TransComm Alpha",
      "TARGETING": "TransComm Beta"
    }
  },
  "mulId": 6349,
  "role": "Brawler",
  "source": "TR:3145:FS"
}