{
  "id": "spartan-spt-n4",
  "chassis": "Spartan",
  "model": "SPT-N4",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "MIXED",
  "rulesLevel": "EXPERIMENTAL",
  "era": "DARK_AGE",
  "year": 3148,
  "tonnage": 80,
  "engine": {
    "type": "XXL",
    "rating": 400
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "REINFORCED"
  },
  "armor": {
    "type": "STEALTH",
    "allocation": {
      "LEFT_ARM": 26,
      "RIGHT_ARM": 26,
      "LEFT_TORSO": {
        "front": 26,
        "rear": 8
      },
      "RIGHT_TORSO": {
        "front": 26,
        "rear": 8
      },
      "CENTER_TORSO": {
        "front": 31,
        "rear": 12
      },
      "HEAD": 9,
      "LEFT_LEG": 26,
      "RIGHT_LEG": 26
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 15
  },
  "movement": {
    "walk": 5,
    "jump": 0
  },
  "equipment": [
    {
      "id": "medium-x-pulse-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-x-pulse-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-x-pulse-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "er-ppc",
      "location": "LEFT_TORSO"
    },
    {
      "id": "tag",
      "location": "LEFT_TORSO"
    },
    {
      "id": "anti-missile-system",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "streak-srm-2",
      "location": "CENTER_TORSO"
    },
    {
      "id": "streak-srm-2",
      "location": "CENTER_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "IS Stealth",
      "IS Stealth",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISMediumXPulseLaser",
      "ISMediumXPulseLaser",
      "ISMediumXPulseLaser",
      "IS Stealth",
      "IS Stealth",
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "CLERPPC",
      "CLERPPC",
      "ISTAG",
      "IS Stealth",
      "IS Stealth",
      null
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "IS Streak SRM 2 Ammo",
      "ISAMS Ammo",
      "ISAntiMissileSystem",
      "ISCASEII",
      "IS Stealth",
      "IS Stealth"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISStreakSRM2",
      "ISStreakSRM2"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "CLECMSuite",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Stealth",
      "IS Stealth"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Stealth",
      "IS Stealth"
    ]
  },
  "quirks": [
    "imp_sensors"
  ],
  "fluff": {
    "overview": "The Spartan, a Star League era BattleMech, began full production just before the Civil War at Terra's Martinson Armaments facility. Conceived as a general service 'Mech, the Spartan was known for its remarkable speed and diverse range capabilities, distinguishing it from similar weight class 'Mechs like the Crockett and Thug. Though only a little over 600 units were produced before the destruction of the manufacturing facility during Stefan Amaris' coup, the Spartan dispersed throughout the Inner Sphere, with a few remaining operational in Com Guards and other factions by 3042.",
    "capabilities": "The Spartan's hallmark was its versatility across various combat ranges. Its primary long-range weapon, the Kinslaughter ER PPC, was notable for its lower heat generation and ease of maintenance. Medium-range combat was handled by three Blankenburg Technologies medium pulse lasers, offering greater damage output despite a slightly reduced range. For close engagements, it relied on two Streak SRM-2 packs located in the upper center torso. A unique feature was its auxiliary escape hatch, providing an alternate exit when standard ejection was compromised. Its superior speed, capable of reaching over 86 kph, allowed Spartan pilots to effectively control engagement ranges, using speed as a defensive asset.",
    "history": "The Spartan, initially produced in limited numbers by the Star League, saw a decline in deployment during the Succession Wars due to production cessation and battlefield attrition. Despite this, the 'Mech maintained a niche presence, particularly among mercenary groups and peripheral states where its balanced capabilities in assault roles were valued. The Spartan's rarity made it a target for salvage operations, and those that survived became prized assets for their owners.<p>Post-Star League, the Spartan's presence dwindled significantly, with only a few units known to be operational. Notably, Snord's Irregulars operated a few well-maintained Spartans, utilizing them effectively in various combat scenarios. This period marked the Spartan as a symbol of lost Star League technology, with its operational units being remnants of a bygone era.</p><p>The Word of Blake's period saw a brief attempt at reviving the Spartan, with efforts to produce new units on Terra. However, this initiative was short-lived and had minimal impact on the Spartan's overall presence in the Inner Sphere.</p><p>In the post-Jihad era, the discovery of Spartan blueprints by the Capellan Confederation led to a resurgence in interest. The Capellans developed the SPT-N4 variant, which incorporated modern technology into the classic design. This variant aimed to enhance the Spartan's battlefield utility while retaining its fundamental characteristics. The reintroduction of the Spartan into modern warfare, especially its sale to prominent units like the Wolf's Dragoons, indicated its enduring legacy as a versatile and reliable 'Mech, despite its historical scarcity and the challenges of modern mech combat.</p>",
    "deployment": "The Spartan SPT-N4, an advanced variant of the Spartan line, signifies a major advancement in BattleMech technology and combat effectiveness. This 80-ton Mech, optimized for brawling, is powered by a 400 XXL Engine, allowing it to achieve speeds of up to 54 kph. The XXL Engine, while offering remarkable speed for a Mech of this size, comes with the trade-off of increased vulnerability due to its compact size, making it more susceptible to critical damage.<p>The Spartan SPT-N4's reinforced Inner Sphere structure provides enhanced durability, ensuring it can withstand intense combat scenarios without sacrificing mobility. This balance of resilience and agility is essential for a brawler Mech.</p><p>One of the standout features of the SPT-N4 is its Stealth Armor. This advanced armor system greatly enhances its survivability on the battlefield by making it more difficult for enemy units to acquire and maintain a lock-on, a critical advantage for a frontline brawler. However, the Stealth Armor also increases the Mech's overall heat generation and requires more complex maintenance, demanding careful heat management in battle.</p><p>The Spartan SPT-N4's armament is tailored for close to medium-range combat. It is equipped with three Medium X-Pulse Lasers in the right arm, delivering higher damage output and enhanced accuracy. The right torso houses an Anti-Missile System, bolstering its defenses against missile attacks.</p><p>For additional firepower, the SPT-N4 carries two Streak SRM 2 launchers in the center torso, which ensure efficient missile strikes with minimal ammunition wastage. The inclusion of an ER PPC in the left torso provides a formidable long-range attack option, complementing its weapon suite. A TAG system is also integrated, augmenting its capability to designate targets for allied forces, making the SPT-N4 a valuable asset in coordinated team strategies.</p>",
    "manufacturer": "Ceres Metals Industries",
    "primaryFactory": "Capella",
    "systemManufacturer": {
      "CHASSIS": "Geometric 500 Reinforced",
      "ENGINE": "Hermes 400 XXL",
      "ARMOR": "Ceres Durallex Heavy Stealth",
      "COMMUNICATIONS": "Blow 300 SNA Net",
      "TARGETING": "Scope 40 RNDST"
    }
  },
  "mulId": 9579,
  "role": "Brawler",
  "source": "RG33"
}