{
  "id": "dragon-drg-2y-yoriyoshi",
  "chassis": "Dragon",
  "model": "DRG-2Y (Yoriyoshi)",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "STANDARD",
  "era": "SUCCESSION_WARS",
  "year": 3025,
  "tonnage": 60,
  "engine": {
    "type": "FUSION",
    "rating": 300
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 20,
      "RIGHT_ARM": 20,
      "LEFT_TORSO": {
        "front": 21,
        "rear": 7
      },
      "RIGHT_TORSO": {
        "front": 21,
        "rear": 7
      },
      "CENTER_TORSO": {
        "front": 30,
        "rear": 9
      },
      "HEAD": 9,
      "LEFT_LEG": 28,
      "RIGHT_LEG": 28
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 16
  },
  "movement": {
    "walk": 5,
    "jump": 0
  },
  "equipment": [
    {
      "id": "1-islargelaser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "1-ismediumlaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-issmalllaser",
      "location": "HEAD"
    },
    {
      "id": "1-isflamer",
      "location": "CENTER_TORSO"
    },
    {
      "id": "1-issrm4",
      "location": "CENTER_TORSO,_AMMO:25"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISMediumLaser",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Heat Sink",
      "ISLargeLaser",
      "ISLargeLaser",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Heat Sink",
      "ISSRM4 Ammo",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Heat Sink",
      "Heat Sink",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Engine",
      "Engine",
      "Engine",
      "ISSRM4",
      "ISFlamer"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "ISSmallLaser",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "low_profile",
    "stable"
  ],
  "fluff": {
    "overview": "The Dragon is a heavy BattleMech originally designed in a bid to replace the Shadow Hawk.",
    "capabilities": "A close assault 'Mech, its versatile design allows it to be used in both offensive and defensive operations. It boasts above-average firepower and plenty of ammunition for extended combat, while a Vlar 300 fusion engine gives it a high top speed for a heavy 'Mech. Armor coverage for the Dragon's ten tons is thick around the torso, and especially the rear, for when it is surrounded by opponents, while the squat design gives it a smaller profile and makes it harder to knock over. The lack of any especially heat-intensive equipment makes the use of only ten heat sinks a non-issue. The Dragon's only major problem is it requires frequent maintenance and/or overhaul of its hip actuator.",
    "history": "Debuting in 2754 during the twilight years of the Star League, the Dragon was turned down by the SLDF in favor of an upgraded Shadow Hawk, though it would be quietly picked up by the Draconis Combine. With the dissolution of the Star League and the onset of the Succession Wars, the Dragon became the Combine's standard heavy 'Mech. Multiple production lines on many well-defended worlds, including Luthien, meant the design was so prevalent every battalion and almost every company featured the Dragon, with some battalions comprised of nothing but these 'Mechs. So many were produced that the Federated Suns and Lyran Commonwealth employed salvaged Dragons in their own arsenals, while many mercenary commands used captured or purchased models. The Free Rasalhague Republic would also adopt the 'Mech following their formation. The beginning of the end came around 3025 when the Grand Dragon, an improved version of the Dragon, entered the prototype phase. By 3040 initial production had begun on this upgraded model with several Dragon factories switching over entirely to producing Grand Dragons. Even as the Combine was phasing it out of service the original Dragon was not wholly abandoned and it saw combat during the Clan Invasion. By 3065 Luthien Armor Works had ceased production altogether on the Dragon, though it would remain within the DCMS' inventory for some time.",
    "deployment": "The personal 'Mech of Benjamin Military District commander Warlord Syovo Yorioshi during the DCMS's Third Succession War invasion of Galtor III, all the standard weaponry of a Dragon save the left-arm mounted Medium Laser has been removed. Instead a Large Laser is mounted in the right arm, a Small Laser in the head and a SRM-4 and Flamer mounted where the LRM rack would normally be. With a single ton of SRM reloads, the weight saved allows five extra heat sinks to be carried and three more tons of armor to be added.",
    "manufacturer": "Refit",
    "primaryFactory": "Various",
    "systemManufacturer": {
      "CHASSIS": "Alshain Type 56-60H",
      "ENGINE": "Vlar 300",
      "ARMOR": "Starshield",
      "COMMUNICATIONS": "Sipher CommSys 3",
      "TARGETING": "Eagle Eye SY10-10"
    }
  },
  "mulId": 910,
  "role": "Skirmisher",
  "source": "HTP:Galtor"
}