{
  "id": "warhammer-whm-6d",
  "chassis": "Warhammer",
  "model": "WHM-6D",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "STANDARD",
  "era": "SUCCESSION_WARS",
  "year": 2835,
  "tonnage": 70,
  "engine": {
    "type": "FUSION",
    "rating": 280
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 22,
      "RIGHT_ARM": 22,
      "LEFT_TORSO": {
        "front": 22,
        "rear": 8
      },
      "RIGHT_TORSO": {
        "front": 22,
        "rear": 8
      },
      "CENTER_TORSO": {
        "front": 34,
        "rear": 10
      },
      "HEAD": 9,
      "LEFT_LEG": 30,
      "RIGHT_LEG": 30
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 20
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "medium-laser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "medium-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "ppc",
      "location": "LEFT_ARM"
    },
    {
      "id": "ppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "small-laser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "small-laser",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "PPC",
      "PPC",
      "PPC",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "PPC",
      "PPC",
      "PPC",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Heat Sink",
      "Heat Sink",
      "Medium Laser",
      "Small Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Heat Sink",
      "Medium Laser",
      "Small Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Heat Sink",
      "Heat Sink"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ]
  },
  "quirks": [
    "rugged_2",
    "searchlight",
    "stable",
    "ubiquitous_clan",
    "ubiquitous_is"
  ],
  "fluff": {
    "overview": "The Warhammer proved to be a very capable 'Mech, and for centuries practically defined the entire class of heavy 'Mechs. Boasting incredible firepower and respectable armoring, the Warhammer served prominently in the Star League Defense Force and was one of the premier 'Mechs in the Gunslinger Program. Indeed, many of the greatest MechWarriors in history were Warhammer pilots.",
    "capabilities": "The Warhammer was well-protected with strong armor for its age and weight, and the large number of heat sinks allowed it to \"fire and maneuver\" without fear. The most common engine arrangement propels the 'Mech to a cruising speed of 43.2 km/h and a top speed of 64.8 km/h, which is quick enough to keep up with most battles. The 'Mech's electronics, albeit antiquated by the 31st Century, were basic and functional, allowing it to assume command tasks when necessary. The targeting mechanism, in particular, made use of an unique Searchlight positioned above the 'Mech's left shoulder. The device could act as a conventional searchlight or immediately connect to the O/P 1500 ARB tracking system, transforming the 'Mech into a capable night fighter.",
    "history": "StarCorps Industries introduced the Warhammer BattleMech in 2515 as \"a mobile 'Mech with adequate firepower to destroy or severely damage any 'Mech of the same weight class or lower.\" The Warhammer continued to serve in the forces of the Great Houses throughout the Succession Wars after the Star League's demise. Despite very modest production rates, the large number of Warhammer factories dispersed over both the Inner Sphere and Periphery contributed to its endurance; Ronin Inc. was never able to construct more than five Warhammers per year from their Wallis factory. The recovery of the Helm Memory Core would prompt Inner Sphere manufacturers to create a slew of new Lostech-powered Warhammer versions, while the Periphery continued to produce original models for mercenaries and black marketeers. After the Clan Invasion, StarCorps chose to rehabilitate the ancient 'Mech with the greatest technological advancements, giving it new life. Initially, the business planned to construct only one new variety from its Crofton plant, but when word of the idea spread, other departments within StarCorps became involved and gathered on Crofton for a week-long conference to iron out the details. The conference turned out to be more jubilant than expected, and at the end of the bacchanalian \"negotiations,\" it was determined that four new variations would be built: one for each of the Federated Suns, Capellan, Free Worlds League, and Lyran forces, employing technology unique to each realm. During the FedCom Civil War, some of these new 'Mechs were put through their paces.",
    "deployment": "An alteration of the 6R model introduced in 2835, the 6D removed the machine guns and the SRM-6 launcher to add an additional four tons of armor to the design, increasing its leg protection, as well as two more heat sinks. The 6D was particularly favored by the Federated Suns.",
    "manufacturer": "StarCorps Industries,",
    "primaryFactory": "Crofton",
    "systemManufacturer": {
      "CHASSIS": "StarCorps 100",
      "ENGINE": "VOX 280",
      "ARMOR": "Leviathon Plus",
      "COMMUNICATIONS": "O/P 3000 COMSET",
      "TARGETING": "O/P 1500 ARB"
    }
  },
  "mulId": 3485,
  "role": "Brawler",
  "source": "TR:3039"
}