{
  "id": "banshee-bnc-5s",
  "chassis": "Banshee",
  "model": "BNC-5S",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3053,
  "tonnage": 95,
  "engine": {
    "type": "XL",
    "rating": 380
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 21,
      "RIGHT_ARM": 21,
      "LEFT_TORSO": {
        "front": 30,
        "rear": 10
      },
      "RIGHT_TORSO": {
        "front": 30,
        "rear": 10
      },
      "CENTER_TORSO": {
        "front": 40,
        "rear": 17
      },
      "HEAD": 9,
      "LEFT_LEG": 26,
      "RIGHT_LEG": 26
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 14
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "1-isgaussrifle",
      "location": "LEFT_TORSO,_AMMO:8"
    },
    {
      "id": "2-iserppc",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-issrm6",
      "location": "RIGHT_ARM,_AMMO:15"
    },
    {
      "id": "1-ismediumlaser",
      "location": "LEFT_TORSO_(R)"
    },
    {
      "id": "1-ismediumlaser",
      "location": "RIGHT_TORSO_(R)"
    },
    {
      "id": "2-ismediumlaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-issmalllaser",
      "location": "CENTER_TORSO"
    },
    {
      "id": "1-issmalllaser",
      "location": "HEAD"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISMediumLaser",
      "ISMediumLaser",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISSRM6",
      "ISSRM6",
      "ISSRM6 Ammo",
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISMediumLaser (R)",
      "ISGauss Ammo"
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISMediumLaser (R)",
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISSmallLaser",
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "ISSmallLaser",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "rugged_1",
    "bad_rep_is"
  ],
  "fluff": {
    "overview": "The Banshee, introduced in 2445 by the Terran Hegemony, is a 'Mech that was designed specifically for close-assault operations during the early years of BattleMech warfare.",
    "capabilities": "A contemporary of the Mackie and Emperor, the Banshee is undeniably fast for one of the heaviest 'Mechs ever produced, and with fifteen tons of armor it is better protected than most other assault 'Mechs. However the use of a massive GM 380 fusion engine left little room for weaponry, and even at the time of its introduction the Banshee was considered undergunned compared to its privately-built competition. As critics noted, what use was impressive armor and mobility if a better-armed enemy could overwhelm and destroy it? The result was a mediocre 'Mech which even the lowly Rifleman could beat as long as it prevented the Banshee's mass from coming into play.",
    "history": "The Hegemony soldiered on though, producing five thousand Banshees in a decade before its poor combat performance finally forced them to stop production in 2455 and the 'Mech was relegated to training and militia units for the next few centuries. Even during the Succession Wars the 'Mech's poor reputation meant many commanders saw it as a liability rather than an asset; unless they were fighting on a backwater Periphery world or as part of a poorly-equipped outfit, most Banshees were placed in second-line reserves to provide fire support or fulfill the role of brawlers so that better-armed 'Mechs need not engage in hand-to-hand combat. In this way fully a third of the original Banshee production run remained operational by the dawn of the thirty-first century and could be found throughout the Inner Sphere and Periphery, with the lion's share residing within the Lyran Commonwealth. Though a few attempts had been made over the years to improve the Banshee, Defiance Industries was the first to produce a variant which markedly improved on the original and was suggested by many of its original critics. With help from the Federated Suns and access to blueprints from the original Hesperus II factories, the BNC-3S proved to be such a success the Lyrans began fielding them in front line units, surprising their enemies who ignored them to focus on \"real\" threats with thoroughly unexpected firepower. Under the Federated Commonwealth improvements would continue to be made, though not at the same priority level as other projects, and the much-improved BNC-5S was active in time to meet the Clan Invasion.",
    "deployment": "An upgrade of the 3S variant using Star League technology, the 5S replaces the engine with an XL engine and uses double heat sinks to save weight, restoring its top speed to 64.8 km/h. The 'Mech is armed for long range combat with a Poland Main Model A Gauss rifle and two Defiance 1001 ER PPCs. For close ranges, the 'Mech has a TharHes Maxi SRM-6, four Defiance B3M medium lasers, and two Defiance B3S Small Lasers, and is also equipped with an Angst Clear Channel 3 comsys.",
    "manufacturer": "HDF Manufacturing,Defiance Industries",
    "primaryFactory": "Falsterbo,Hesperus II",
    "systemManufacturer": {
      "CHASSIS": "Foundation",
      "ENGINE": "Edasich Motors",
      "ARMOR": "Longanecker",
      "COMMUNICATIONS": "Angst",
      "TARGETING": "Angst"
    }
  },
  "mulId": 247,
  "role": "Sniper",
  "source": "TR:3050"
}