{
  "id": "battlemaster-blr-3m-rogers",
  "chassis": "BattleMaster",
  "model": "BLR-3M (Rogers)",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3057,
  "tonnage": 85,
  "engine": {
    "type": "FUSION",
    "rating": 340
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "FERRO_FIBROUS",
    "allocation": {
      "LEFT_ARM": 28,
      "RIGHT_ARM": 28,
      "LEFT_TORSO": {
        "front": 28,
        "rear": 8
      },
      "RIGHT_TORSO": {
        "front": 28,
        "rear": 8
      },
      "CENTER_TORSO": {
        "front": 41,
        "rear": 11
      },
      "HEAD": 9,
      "LEFT_LEG": 35,
      "RIGHT_LEG": 35
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 13
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "1-ismediumlaser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-ismediumlaser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-ismediumlaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-ismediumlaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-ismediumlaser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-ismediumlaser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-iserppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "LEFT_TORSO,_AMMO:50"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-isstreaksrm2",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISMediumLaser",
      "ISMediumLaser",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "ISMediumLaser",
      "ISStreakSRM2",
      "ISStreakSRM2",
      "ISStreakSRM2",
      "ISStreakSRM2",
      "ISStreakSRM2",
      "ISMediumLaser",
      "ISStreakSRM2 Ammo",
      "ISCASE",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "RIGHT_TORSO": [
      "ISMediumLaser",
      "ISStreakSRM2",
      "ISStreakSRM2",
      "ISMediumLaser",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "CENTER_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Engine",
      "Engine",
      "Engine",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Ferro-Fibrous",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "command_mech",
    "weak_head_1"
  ],
  "fluff": {
    "overview": "Versatile and powerful, the BattleMaster was one of the best known BattleMechs in existence. Hollis Industries began production in 2633, originally designing it to be the largest and most powerful 'Mech for the Star League armies at that time.",
    "capabilities": "Indeed the sheer size of the BattleMaster, combined with the costs and resources needed to build one, meant the 'Mech could only be manufactured on a few planets. Still, those lucky enough to pilot a BattleMaster can attest to some of the stories surrounding the 'Mech. With good reliability, firepower and armoring, the BattleMaster is equally adept anchoring an assault lance or serving as a command vehicle.",
    "history": "Although only produced in modest numbers, examples of the BattleMaster could be found in the arsenals of all the Great Houses and technicians have gone to great lengths in order to repair one. During the First Succession War Hollis' BattleMaster factories on Corey were attacked, their production lines destroyed and any finished BattleMasters purloined by the various House forces. While production of new BattleMasters was taken up by Earthwerks Incorporated on Keystone, Trellshire Heavy Industries on Twycross, and Red Devil Industries on Pandora, they could build only a handful of new 'Mechs every year. This was enough though to make House Steiner and House Marik the largest users of BattleMasters during the Succession Wars. House Liao also fielded a large number of BattleMasters, at least until the devastation of the Fourth Succession War when many fell into the hands of the Federated Suns, themselves lacking any BattleMaster factories. By fortuitous accident the Draconis Combine also came into possession of a large number of BattleMasters when a hapless ComStar Precentor, intending to ship unmodified versions of advanced BattleMasters to Com Guard units, sent them to the Combine instead. These BattleMasters served as excellent command vehicles during the War of 3039. New models of the BattleMaster would be introduced in time to take part in the Clan Invasion. Although the manufacture of new BattleMasters was disrupted when Twycross fell to Clan Jade Falcon, the recapture of that world allowed for a brief resumption of production. While Pandora did not fall during the Invasion an effort was made to relocate its BattleMaster factory, but the haphazard nature of the factory and feet-dragging by the planet's corrupt nobility delayed this effort. It wasn't until 3061 that the Red Devil factory was finally ready to be closed when the nobility's lobbying paid off and instead funds were allocated by Archon Katherine Steiner-Davion to refurbish the factory. As part of the arrangement a deal was struck with J.B. BattleMechs Incorporated to produce a new variant, the BLR-4S. Initial units were built starting in 3062 but the FedCom Civil War would delay full-scale production until 3064, by which time the second Jade Falcon Incursion captured the planet and put these new BattleMasters to work in their second-line units. This left the hard-pressed J.B. BattleMechs' factory on Storfors to build the BLR-4S for the Lyran Alliance, while the Free Worlds League and Combine would come out with their own variants.",
    "deployment": "Used by Colonel Wayne Rogers of Waco Rangers during the Coventry campaign, this BattleMaster drops five heat sinks, the single machine gun, and the SRM-6 of a BLR-3M and replaces them with seven Streak SRM-2 launchers. The loss of some armor is compensated for by using Ferro-Fibrous Armor instead.",
    "manufacturer": "Refit",
    "primaryFactory": "Various",
    "systemManufacturer": {
      "CHASSIS": "Hollis Mark X",
      "ENGINE": "VOX 340",
      "ARMOR": "StarGuard CIV Ferro-Fibrous",
      "COMMUNICATIONS": "HarfordCo COM 4000",
      "TARGETING": "HarfordCo XKZ 1"
    }
  },
  "mulId": 3805,
  "role": "Brawler",
  "source": "OTP:FI"
}