{
  "id": "cataphract-ctf-3l",
  "chassis": "Cataphract",
  "model": "CTF-3L",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3050,
  "tonnage": 70,
  "engine": {
    "type": "XL",
    "rating": 280
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 22,
      "RIGHT_ARM": 22,
      "LEFT_TORSO": {
        "front": 16,
        "rear": 9
      },
      "RIGHT_TORSO": {
        "front": 16,
        "rear": 9
      },
      "CENTER_TORSO": {
        "front": 26,
        "rear": 9
      },
      "HEAD": 9,
      "LEFT_LEG": 19,
      "RIGHT_LEG": 19
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 16
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "1-islbxac10",
      "location": "RIGHT_TORSO,_AMMO:20"
    },
    {
      "id": "1-iserppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "LEFT_TORSO_(R)"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "RIGHT_TORSO_(R)"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "RIGHT_ARM"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISMediumPulseLaser",
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "ISMediumPulseLaser"
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISMASC",
      "ISMASC",
      "ISMASC",
      "ISMASC",
      "ISMediumPulseLaser (R)",
      null
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISMediumPulseLaser (R)",
      "ISLBXAC10 CL Ammo",
      "ISLBXAC10 Ammo"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      null,
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "pro_actuator"
  ],
  "fluff": {
    "overview": "The Cataphract is a heavy BattleMech and one of the first original designs since the start of the Succession Wars.",
    "capabilities": "The Cataphract, with its armor layers, can easily absorb damage, but it can also deal it. The CeresArms Smasher PPC (taken from the Vindicator) and the SarLon MaxiCannon combine to deliver a brutal punch at greater ranges. A quartet of CeresArms medium lasers close in to give short-range firepower to both the front and rear.",
    "history": "Desperate for a heavy 'Mech design that could be produced and maintained sustainably by their deteriorating infrastructure, the Capellan Confederation built the Cataphract in 3025 to be assembled from pieces they could still manufacture. The Cataphract, dubbed a FrankenMech for its appearance and built with parts from the Marauder, Shadow Hawk, and Phoenix Hawk, was destined to become the Confederation's new standard heavy 'Mech. It entered service just before the Fourth Succession War, when the Tikonov production line was taken over by the Federated Suns. This humiliating defeat was exacerbated when numerous Davion troops, especially the Crucis Lancers, adopted the Cataphract as their own. Tikonov's product quality, on the other hand, left the Federated Suns wanting (at least in part due to deliberate obstruction by workers still loyal to the Confederation). The Confederation finally restored the lost plant with one on Betelgeuse in 3032, building their own Cataphracts in time for the Andurien Crisis. Shortly after seizing Tikonov, the Federated Commonwealth began development of the CTF-3D, which was designed to compete with an attack 'Mech while being as adaptable as feasible. Despite the modifications, the CTF-3D was only used sparingly by the Armed Forces of the Federated Commonwealth before being consigned to the Crucis March Militia as an affront to the Capellans. When the Clan Invasion began, everything that was still in production, including the Cataphract, was rushed to the front lines. The Capellans, for their part, were able to manufacture the CTF-3D from stolen schematics and went on to create their own variant, the CTF-3L, which would go on to account for 25% of all newly acquired heavy 'Mechs during the 3050s. The design's popularity would decrease in the years that followed, while a few new varieties would continue to be created as new technologies and demands arose.",
    "deployment": "Produced by the Capellans based on stolen Davion designs, the 3L is an upgraded version of the Cataphract that follows more in line with the prototype 1X model. It is propelled by an XL engine with MASC instead of jump jets allowing it to reach speeds of 86.4 km/h in short bursts. While it is also armed with an LB-X autocannon/10 as its primary weapon this is instead matched with a Ceres Arms Warrior ER PPC for powerful striking capabilities at long range. Other differences include the use of four Ceres Arms Model W medium pulse lasers and double heat sinks in place of the standard models. This design was produced by the Confederation at Grand Base following the ascension of Chancellor Romano Liao.",
    "manufacturer": "Earthwerks Ltd.",
    "primaryFactory": "Grand Base",
    "systemManufacturer": {
      "CHASSIS": "Earthwerks CTF",
      "ENGINE": "280 GM XL",
      "ARMOR": "Kallon Royalstar with CASE",
      "COMMUNICATIONS": "CommuTech Multi-Channel 10",
      "TARGETING": "BlazeFire Sightlock"
    }
  },
  "mulId": 470,
  "role": "Sniper",
  "source": "TR:3050"
}