{
  "id": "cyclops-cp-11-c",
  "chassis": "Cyclops",
  "model": "CP-11-C",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3050,
  "tonnage": 90,
  "engine": {
    "type": "FUSION",
    "rating": 360
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 15,
      "RIGHT_ARM": 15,
      "LEFT_TORSO": {
        "front": 24,
        "rear": 8
      },
      "RIGHT_TORSO": {
        "front": 24,
        "rear": 8
      },
      "CENTER_TORSO": {
        "front": 34,
        "rear": 11
      },
      "HEAD": 9,
      "LEFT_LEG": 22,
      "RIGHT_LEG": 22
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 12
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "medium-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "c3-master-with-tag",
      "location": "LEFT_TORSO"
    },
    {
      "id": "gauss-rifle",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "srm-4",
      "location": "CENTER_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Medium Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Medium Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "ISC3MasterUnit",
      "ISC3MasterUnit",
      "ISC3MasterUnit",
      "ISC3MasterUnit",
      "ISC3MasterUnit",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "IS Gauss Ammo",
      "IS Gauss Ammo",
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "SRM 4",
      "IS Ammo SRM-4"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "battle_computer",
    "cowl",
    "difficult_eject",
    "weak_head_2"
  ],
  "fluff": {
    "overview": "The Cyclops began production in 2710 as an assault BattleMech and headquarters unit for Star League Defense Force field commanders.",
    "capabilities": "A decent mix of weapons provided the Cyclops with both long- and short-range firepower and a sizable engine to keep up with mobile operations. But the centerpiece of the Cyclops is its sophisticated holographic battle computer, the Tacticon B-2000. When combined with the Olmstead 840 tight beam comm suite with SatNav module, the Cyclops can effectively command a brigade across the surface of an entire world. Unfortunately the Cyclops is poorly protected relative to other assault 'Mechs with only ten tons of armor, and while its normal load of twelve heat sinks allows it to stay cool in most cases, they can prove to be inadequate in especially heavy situations.",
    "history": "Unfortunately the Cyclops did not fare so well with the onset of the Amaris Civil War when the Rim Worlds Republic Military destroyed its primary factory on Caph in 2774. Spare parts for the machine quickly began to dry up, until by the end of the Succession Wars less than ten percent still had a working B-2000 computer. Lacking the critical part of being a command vehicle many Cyclopses were pressed into an assault role. Acting as the bodyguard or decoy for the real commanding officer, they proved to be swift if mediocre combat machines. As most enemies know about the vulnerable head and automatically target it in combat, many Cyclops pilots also began adding false head protectors to defend against impacts. A study by the NAIS after the Fourth Succession War would eventually find that these caused more harm than good by restricting vision and increasing shrapnel, ending the practice altogether. The rediscovery of the Helm Memory Core kick-started a number of attempts to replicate the B-2000 computer, however there were no successful attempts prior to the Clan Invasion. Also, the invention of the C3 Computer with its emphasis on small-scale networking, and a switch in doctrine to using DropShips as command posts, saw the Cyclops' command role decline. However Grumium Creations was eventually able to restart production of new variants of the 'Mech, and where it has participated a Cyclops with a working B-2000 has had noticeable effects. For this reason Cyclops 'Mechs with a working battle computer were reserved for high-ranking officers.",
    "deployment": "The 11-C is similar to the 11-A in that they carry an almost identical weapons payload. Built in 3050 the only difference is that the 11-C has removed the LRM-10 launcher and replaced it with a C3 Computer, which allows it to share targeting data and coordinate C3 lances. An additional two tons of armor have been added to the design as well. This makes the 11-C a highly effective sniper and command 'Mech.",
    "manufacturer": "Field Refit",
    "primaryFactory": "Various",
    "systemManufacturer": {
      "CHASSIS": "Stormvanger HV-7",
      "ENGINE": "Hermes 360",
      "ARMOR": "Starshield Special",
      "COMMUNICATIONS": "Olmstead 840",
      "TARGETING": "Tacticon Tracer 280"
    }
  },
  "mulId": 775,
  "role": "Brawler",
  "source": "TR:3050"
}