{
  "id": "enforcer-enf-5d",
  "chassis": "Enforcer",
  "model": "ENF-5D",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3050,
  "tonnage": 50,
  "engine": {
    "type": "XL",
    "rating": 250
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "FERRO_FIBROUS",
    "allocation": {
      "LEFT_ARM": 16,
      "RIGHT_ARM": 16,
      "LEFT_TORSO": {
        "front": 19,
        "rear": 5
      },
      "RIGHT_TORSO": {
        "front": 19,
        "rear": 5
      },
      "CENTER_TORSO": {
        "front": 23,
        "rear": 7
      },
      "HEAD": 9,
      "LEFT_LEG": 21,
      "RIGHT_LEG": 21
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 12
  },
  "movement": {
    "walk": 5,
    "jump": 5
  },
  "equipment": [
    {
      "id": "1-islbxac10",
      "location": "RIGHT_ARM,_AMMO:20"
    },
    {
      "id": "1-iserlargelaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-issmalllaser",
      "location": "LEFT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISERLargeLaser",
      "ISERLargeLaser",
      "Ferro-Fibrous",
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "ISLBXAC10",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet",
      "Jump Jet",
      "ISSmallLaser",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet",
      "Jump Jet",
      "ISLBXAC10 CL Ammo",
      "ISLBXAC10 Ammo",
      "ISCASE",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet",
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      null
    ]
  },
  "quirks": [
    "barrel_fists_la",
    "barrel_fists_ra"
  ],
  "fluff": {
    "overview": "Since it first walked off of the production line, the Enforcer has been the iconic medium-weight workhorse of the Federated Suns' Succession Wars era military.",
    "capabilities": "The Enforcer fulfilled the roles of a mobile barrage vehicle, laying down an intense hail of fire as a prelude to an offensive or to blunt an enemy's attack, and as a trooper 'Mech, using its thick frontal armor and good jumping distance of one hundred and twenty meters to effectively brawl with the enemy despite lacking hand actuators. The sturdy and inexpensive design's mobility also made it an ideal city fighter, especially when sniping the enemy during hit-and-run attacks. One of the design's problems was that, with most of its nine tons of armor concentrated forward, the amount of protection in its rear torso is less than on some light 'Mechs. The Enforcer's biggest flaw though was its limited ammunition stores, though when possible a truck-and-crane reloading system is used during less-mobile battles. Attempts were made to replace the small laser with another ton of ammunition, however there were complicated linkage problems in getting the ammo from the left torso to the right arm, increasing the rate of jamming or reducing the rate of fire to unacceptable levels. What's more the rounds had to be routed along the 'Mechs back where its armor was weakest.",
    "history": "This is in large part due to production of the Enforcer remaining largely undisturbed throughout the Succession Wars, despite the relative lack of industrialization that has long hampered the Federated Suns. With the autocannon-obsessed Armed Forces of the Federated Suns building up its BattleMech forces upon the collapse of the Star League, the discovery on Achernar of schematics for an unbuilt autocannon-carrying Star League 'Mech was a case of perfect timing. Modifying the design by swapping two medium lasers for a single larger one, Achernar BattleMechs rushed it through development and began production in 2777.",
    "deployment": "First walking off the production line in late 3050, the 5D Enforcer is a major upgrade to the standard 'Mech, meeting many of its pilots' desire for something faster, better-protected and with more endurance. The Nissan 200 engine has been removed and replaced with a Magna 250 Extralight Engine, increasing the Enforcer's top speed to 86.4 km/h and the amount of space available for other additions. The armor has been stripped from the 'Mech and replaced with StarGuard CIV Ferro-Fibrous armor with CASE to protect against an ammunition explosion while the weapons payload has also been changed. Retaining the small laser both the Autocannon/10 and the Large Laser were replaced for a new Mydron Excel LB-X Autocannon/10, fed by two tons of ammunition, and a BlazeFire Sweetshot ER Large Laser. Finally, an additional jump jet was added, increasing the jumping distance by thirty meters to keep up with the Enforcer's new speed profile",
    "manufacturer": "Achernar BattleMechs, Kallon Weapon Industries",
    "primaryFactory": "New Avalon, Talon",
    "systemManufacturer": {
      "CHASSIS": "Dorwinion Standard",
      "ENGINE": "Magna 250 XL",
      "ARMOR": "StarGuard CIV Ferro-Fibrous with CASE",
      "JUMPJET": "McCloud Specials",
      "COMMUNICATIONS": "Achernar Electronics HICS-11",
      "TARGETING": "Federated Hunter"
    }
  },
  "mulId": 978,
  "role": "Skirmisher",
  "source": "TR:3050"
}