{
  "id": "highlander-hgn-734",
  "chassis": "Highlander",
  "model": "HGN-734",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3062,
  "tonnage": 90,
  "engine": {
    "type": "LIGHT",
    "rating": 270
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 30,
      "RIGHT_ARM": 30,
      "LEFT_TORSO": {
        "front": 28,
        "rear": 10
      },
      "RIGHT_TORSO": {
        "front": 28,
        "rear": 10
      },
      "CENTER_TORSO": {
        "front": 42,
        "rear": 16
      },
      "HEAD": 9,
      "LEFT_LEG": 38,
      "RIGHT_LEG": 38
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 14
  },
  "movement": {
    "walk": 3,
    "jump": 3
  },
  "equipment": [
    {
      "id": "1-islbxac20",
      "location": "RIGHT_TORSO,_AMMO:15"
    },
    {
      "id": "1-isermediumlaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-isermediumlaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-iserlargelaser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-isstreaksrm6",
      "location": "LEFT_TORSO,_AMMO:15"
    },
    {
      "id": "1-isstreaksrm6",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "CENTER_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISERMediumLaser",
      "ISERMediumLaser"
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISLBXAC20"
    ],
    "LEFT_TORSO": [
      "Engine",
      "Engine",
      "ISStreakSRM6",
      "ISStreakSRM6",
      "ISStreakSRM6",
      "ISStreakSRM6",
      "ISStreakSRM6 Ammo",
      "ISLBXAC20 CL Ammo",
      "ISLBXAC20 Ammo",
      "ISLBXAC20 Ammo",
      "ISCASE",
      null
    ],
    "RIGHT_TORSO": [
      "Engine",
      "Engine",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISLBXAC20",
      "ISLBXAC20",
      "ISERLargeLaser",
      "ISERLargeLaser"
    ],
    "CENTER_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Engine",
      "Engine",
      "Engine",
      "Jump Jet",
      "ISMediumPulseLaser"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Jump Jet",
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Jump Jet",
      null
    ]
  },
  "quirks": [
    "command_mech",
    "cowl",
    "reinforced_legs",
    "difficult_eject"
  ],
  "fluff": {
    "overview": "The Highlander is one of the most well-known Star League Defense Force assault 'Mechs, serving with distinction for almost two centuries since first entering service in 2592.",
    "capabilities": "Initially designed as a dedicated city and installation defender, the original model featured a variety of weaponry along with fifteen and a half tons of Ferro-Fibrous armor, but perhaps its most useful asset were the three HildCo jump jets giving it a jumping range of 90 meters. The heaviest 'Mech design to feature jump jets at the time, their original task was to allow the Highlander the ability to jump over inconvenient obstacles such as buildings and outpace other 'Mechs with a faster ground speed, but because of this increased mobility and its versatile weaponry the Highlander proved to be a capable fighter on any battlefield and within decades nearly every BattleMech regiment of the Regular and Royal Armies featured them.",
    "history": "During the design's initial trial runs pilots began using these 'Mechs in what would infamously become known as the \"Highlander Burial\". Leaping into the air and landing directly on their enemy, a Highlander could literally drive a light 'Mech into the ground. So successful was this maneuver that the design team re-engineered the legs to withstand repeated death-from-above attacks and turned what had been a desperation move into an art form, giving Highlander pilots an additional psychological edge. As with other Star League era designs the Highlander would suffer the loss of technology brought about by the Succession Wars, and when StarCorps' factory on Son Hoa was devastated towards the end of the Second Succession War the original HGN-732 became virtually extinct. An agreement between StarCorps and Hollis Incorporated to rebuild destroyed chassis from scratch using readily-available technology kept the line going until the mid-3030s when limited production was restarted by StarCorps on Son Hoa and Corey, producing barely a dozen new 'Mechs per year. These HGN-733 Highlanders were used in small numbers by the Capellan Confederation and Lyran Commonwealth, commonly as part of lances containing Exterminators, Victors, Grasshoppers and Catapults. Unbeknownst to many, ComStar also maintained a large stock of Highlanders left over from the Star League, some of which they gifted to the Draconis Combine during the War of 3039. The appearance of so many seemingly rare 733s, along with a few 732s whose advanced technology managed to slip through ComStar screening, had a large impact on Lyran morale during that conflict. ComStar would also use the design in their own military forces, the Com Guard, and even during the Clan Invasion a few original 732s would take to the field as part of the Clans' fighting forces. The Northwind Highlanders especially favored this namesake Battlemech. In fact, during the Succession Wars, they were the only Inner Sphere army to keep a large number of them operational, along with ComStar. The Highlanders are specially skilled in delivering the famed Highlander Burial maneuver. By 3057 StarCorps' Son Hoa line was at full production, producing brand-new original-spec Highlanders for Lyran units of the Federated Commonwealth, just in time to take part in the FedCom Civil War. Highlanders would continue to be produced all the way through to the Jihad, where advanced variants fought both for and against the Word of Blake.",
    "deployment": "The 734 Highlander emphasizes its role as an urban combat 'Mech, produced by the Lyran Alliance in the wake of the civil war. The Gauss Rifle has been replaced with a massive LB-X Autocannon/20, the medium lasers have been upgraded to ER Medium Lasers, the SRM-6 was upgraded to a streak version with another Streak SRM-6 launcher added, as well as an ER Large Laser. Upgrading the standard fusion engine to a new Light Engine and removing the LRM-20 launcher allowed these changes.",
    "manufacturer": "StarCorps Industries",
    "primaryFactory": "Son Hoa",
    "systemManufacturer": {
      "CHASSIS": "Star League XT",
      "ENGINE": "GM 270 Light Fusion",
      "ARMOR": "Grumman-3 Ferro Fibrous with CASE",
      "JUMPJET": "HildCo Model 10",
      "COMMUNICATIONS": "Hector VII",
      "TARGETING": "Starlight LX-1"
    }
  },
  "mulId": 1520,
  "role": "Juggernaut",
  "source": "TR:3050"
}