{
  "id": "hussar-hsr-500-d",
  "chassis": "Hussar",
  "model": "HSR-500-D",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3060,
  "tonnage": 30,
  "engine": {
    "type": "XL",
    "rating": 270
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "ENDO_STEEL"
  },
  "armor": {
    "type": "FERRO_FIBROUS",
    "allocation": {
      "LEFT_ARM": 9,
      "RIGHT_ARM": 9,
      "LEFT_TORSO": {
        "front": 11,
        "rear": 3
      },
      "RIGHT_TORSO": {
        "front": 11,
        "rear": 3
      },
      "CENTER_TORSO": {
        "front": 15,
        "rear": 4
      },
      "HEAD": 9,
      "LEFT_LEG": 12,
      "RIGHT_LEG": 12
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 10
  },
  "movement": {
    "walk": 9,
    "jump": 0
  },
  "equipment": [
    {
      "id": "1-isimprovedc3cpu",
      "location": "CENTER_TORSO"
    },
    {
      "id": "1-iserppc",
      "location": "LEFT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel"
    ],
    "RIGHT_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "CENTER_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Engine",
      "Engine",
      "Engine",
      "ISImprovedC3CPU",
      "ISImprovedC3CPU"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Endo-Steel",
      "Endo-Steel"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ]
  },
  "quirks": [
    "imp_com",
    "rugged_1"
  ],
  "fluff": {
    "overview": "The Hussar stands as a hallmark reconnaissance platform within the realms of the Star League Defense Force (SLDF), with its ability to achieve top speeds surpassing 150 kph. This speed advantage rendered the Hussar a challenging target in direct confrontations on the battlefield. Although modern designs have surfaced over time, the Hussar continues to embody the quintessence of a light recon BattleMech. The initial utilization of Hussar by the original SLDF in light 'Mech formations led to its scarce presence among the Great Houses, a scenario exacerbated post the historical Exodus led by General Kerensky.",
    "capabilities": "The Hussar, though notably under-armored when juxtaposed against other recon designs, wasn't crafted to thrive in one-on-one combat scenarios. Its principal design featured an extended-range large laser, a component allowing it to engage adversaries from a long-range distance. The essence of the Hussar’s advantage is rooted in its speed, a fact often overlooked by Lyran pilots, particularly the inexperienced ones accustomed to heavier designs, leading to a significant pilot mortality rate.\nEnhanced communication and surveillance apparatus form a part of the Hussar's core capabilities, with the original Field Ranger Sightseer schematics being replicated in 3055, thus bolstering its reconnaissance prowess. This technological integration rendered the Hussar invaluable during the FedCom Civil War, with its deployment often aimed at disrupting enemy supply lines, embodying a strategy not alien to several hard-line Lyran commanders of the era.",
    "history": "The legacy of the Hussar traces back to its pivotal role within the SLDF as a reconnaissance stalwart. The scarcity of this design among the Great Houses became more pronounced post General Kerensky’s Exodus, leading to its classification as a lost design until its revival by the Com Guards in 3051. The subsequent acquisition of the Hussar design by Coventry Metal Works from Bonn Mekarmorwerks marked a new chapter, leading to the development of new variants between 3055 and 3068. The narrative of the Hussar took a dire turn with the onset of the Jihad, as the Word of Blake’s assault on Coventry halted further advancements and shipments of this iconic design.",
    "deployment": "The 500-D Hussar, built by Bonn Mekarmorwerks and introduced in 3060, follows the pattern of many of the recon 'Mechs of that era by adding advanced electronics to the mix. Once again, the engine has been replaced by an XL engine, retaining the amazing speed for which the Hussar is famous for. The primary weapon on this version is an ER PPC, and the targeting system has been mated to an improved C3 computer, making it deadly accurate at long range when working closely with other units.",
    "manufacturer": "Bonn Mekarmorwerks",
    "primaryFactory": "Terra",
    "systemManufacturer": {
      "CHASSIS": "Benztrov 40 ES",
      "ENGINE": "GM 270 XL",
      "ARMOR": "Lexington Limited High Grade Ferro-Fibrous",
      "COMMUNICATIONS": "Field Ranger Sightseer",
      "TARGETING": "Ranger LAF Model 2"
    }
  },
  "mulId": 1590,
  "role": "Scout",
  "source": "TR:3050"
}