{
  "id": "lancelot-lnc25-04",
  "chassis": "Lancelot",
  "model": "LNC25-04",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3060,
  "tonnage": 60,
  "engine": {
    "type": "XL",
    "rating": 360
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "ENDO_STEEL"
  },
  "armor": {
    "type": "FERRO_FIBROUS",
    "allocation": {
      "LEFT_ARM": 16,
      "RIGHT_ARM": 16,
      "LEFT_TORSO": {
        "front": 18,
        "rear": 10
      },
      "RIGHT_TORSO": {
        "front": 18,
        "rear": 10
      },
      "CENTER_TORSO": {
        "front": 23,
        "rear": 15
      },
      "HEAD": 9,
      "LEFT_LEG": 22,
      "RIGHT_LEG": 22
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 14
  },
  "movement": {
    "walk": 6,
    "jump": 0
  },
  "equipment": [
    {
      "id": "1-iserlargelaser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "1-iserlargelaser",
      "location": "LEFT_ARM"
    },
    {
      "id": "1-iserppc",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-isimprovedc3cpu",
      "location": "CENTER_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "ISERLargeLaser",
      "ISERLargeLaser",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "ISERLargeLaser",
      "ISERLargeLaser",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      "Endo-Steel",
      null
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      "Ferro-Fibrous",
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISImprovedC3CPU",
      "ISImprovedC3CPU"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Ferro-Fibrous",
      "Ferro-Fibrous"
    ]
  },
  "quirks": [
    "anti_air",
    "low_profile",
    "bad_rep_is"
  ],
  "fluff": {
    "overview": "The Lancelot was originally conceived in response to a Star League Defense Force contract for a medium BattleMech that could operate with minimal logistical support, was fast enough to take part in mobile operations and packed sufficient firepower to be a viable threat on the battlefield.",
    "capabilities": "Krupp Technologies attempted to combine the speed of a medium 'Mech with the survivability of a heavy 'Mech in the Lancelot. Despite the use of a lightweight Extralight engine, the production Lancelot ended up in the heavyweight class, but the SLDF was impressed enough with the unit's speed and firepower during its trial runs to make an initial order of 250 in 2581.",
    "history": "An entirely energy-based armament allowed the Lancelot to operate away from friendly supply lines for extended periods, while the use of a Hermes 360XL engine not only made it faster than any other heavy 'Mech at the time but also allowed for thirteen double heat sinks to be installed. The use of only nine and a half tons of armor was considered light for its tonnage, however this was partially offset by the design's mobility and its subtle curves, presenting a narrower silhouette for the enemy to target. Its advanced Krupp KBC battle computer, long a standard in the industry, offered superior internal system monitoring, such as current armor status and skin temperature, without distracting the pilot during combat. The most exceptional part of the Lancelot was its KBC Starsight Model 3 T&T System, which could track and prioritize hundreds of targets and projectiles at once. This also made the Lancelot superior at shooting down enemy fighters, and by all indications it was replacing the Rifleman as the SLDF's standard anti-aircraft 'Mech before the Amaris Civil War put an end to that plan. Many Lancelots, along with Krupp's factory on Mars, were destroyed during the Civil War, and as the advanced systems which had gone into their construction became lostech these 'Mechs came to the brink of extinction. Luthien Armor Works obtained copies of the design and began production after the Second Succession War, but their LNC25-02 model was greatly reduced in capability, most significantly the loss of its mobility. With only average speed now and enough armor plating to withstand only a few solid hits, pilots derisively began referring to the 'Mech as \"the Coffin.\" Whereas before the fall of the Star League the Lancelot could be found in almost all militaries, by the end of the Succession Wars less than a dozen still-functional original models were in service, many heavily modified due to battle damage, alongside a few hundred 02 models, most of which were in the hands of the Draconis Combine. In the wake of the Clan Invasion and the Battle of Tukayyid, Precentor Martial Anastasius Focht would rebuild the Krupp Stellar factory on Mars to restart production of original model Lancelots for the Com Guards along with other advanced variants. Examples of these 'Mechs would also be used by the Word of Blake in the prosecution of their Jihad.",
    "deployment": "This variant of the Lancelot is a completely upgraded version, built to utilize the improved C3 computer in use by ComStar and the Word of Blake. In addition to using an Endo-Steel chassis and added a half-ton of armor, the particle cannon and large lasers were upgraded to Extended Range models. In order to make room for these sweeping changes the medium laser was removed.",
    "manufacturer": "Krupp Stellar Technologies Inc.",
    "primaryFactory": "Mars",
    "systemManufacturer": {
      "CHASSIS": "MangoTech 500SJ Endo",
      "ENGINE": "Hermes 360 XL",
      "ARMOR": "PanzerSlab Ferro-Fibrous",
      "COMMUNICATIONS": "Krupp-COMM 500",
      "TARGETING": "KBC Starsight Model 3"
    }
  },
  "mulId": 1857,
  "role": "Sniper",
  "source": "TR:3050"
}