{
  "id": "thunder-hawk-tdk-7s",
  "chassis": "Thunder Hawk",
  "model": "TDK-7S",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3065,
  "tonnage": 100,
  "engine": {
    "type": "LIGHT",
    "rating": 300
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 32,
      "RIGHT_ARM": 32,
      "LEFT_TORSO": {
        "front": 32,
        "rear": 9
      },
      "RIGHT_TORSO": {
        "front": 32,
        "rear": 9
      },
      "CENTER_TORSO": {
        "front": 49,
        "rear": 12
      },
      "HEAD": 9,
      "LEFT_LEG": 40,
      "RIGHT_LEG": 40
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 10
  },
  "movement": {
    "walk": 3,
    "jump": 0
  },
  "equipment": [
    {
      "id": "gauss-rifle",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "gauss-rifle",
      "location": "LEFT_TORSO"
    },
    {
      "id": "gauss-rifle",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "medium-laser",
      "location": "HEAD"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "Medium Laser"
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "IS Gauss Ammo",
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "IS Gauss Ammo",
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "IS Gauss Ammo",
      "IS Gauss Ammo"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Medium Laser",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "quirks": [
    "variable_range_long",
    "good_rep_1",
    "difficult_maintain",
    "command_mech"
  ],
  "fluff": {
    "overview": "The Thunder Hawk, developed by Norse Technologies for the Amaris-Terran Hegemony invasion, became a staple in General Aleksandr Kerensky's forces. Surviving 'Mechs were taken into Exodus, symbolizing their significance. In the 3050s, Norse-Storm BattleMechs revived the Thunder Hawk among other Star League-era designs.",
    "capabilities": "Dominating the Thunder Hawk's arsenal are three Norse Gauss rifles, accounting for over half its weight. These long-range weapons can incapacitate most foes with a single barrage. Ammunition is distributed throughout the torso to mitigate critical damage risks. However, its Achilles' heel lies in the extra-light Vlar fusion engine. While heavily armored, any breach in the torso significantly compromises the BattleMech’s structural integrity, rendering it inoperable.",
    "history": "The Thunder Hawk became a hallmark of the Lyran Alliance, extensively utilized during the FedCom Civil War. Contrary to its design as a support 'Mech, Loyalists deployed it in direct combat, leveraging its heavy armor. Post-war, Archon Peter Steiner Davion allocated new Thunder Hawks to units loyal to Allied forces. Plans for export are pending until the completion of military restructuring.",
    "deployment": "The Thunder Hawk TDK-7S variant emerged towards the end of the FedCom Civil War, marking Norse-Storm's innovative approach to modernizing the venerable design. This variant was developed to enhance survivability in close combat situations while retaining the Thunder Hawk's signature firepower and speed.<p>In the TDK-7S, Norse designers made a significant modification by replacing the extra-light engine with a more robust 300 Light Engine. This change aimed to increase the 'Mech's longevity in the heat of battle without compromising its main armaments or mobility. To accommodate this heavier engine, the 7S sacrifices two medium lasers, two tons of ammunition for the Gauss Rifles, and a ton of armor.</p><p>Armed with three Gauss Rifles, one each in the right arm, left torso, and right torso, the TDK-7S maintains the Thunder Hawk's capability for delivering devastating long-range strikes. Complementing this are two Medium Lasers, one in the right arm and one in the head, providing effective secondary weaponry for closer engagements.</p><p>As of now, only a dozen TDK-7S models have been produced. Norse-Storm is cautiously monitoring the reception of this variant before committing to full-scale production. This caution stems from the variant's experimental nature and the significant changes made to the original design.</p><p>Despite these alterations, the TDK-7S retains the Thunder Hawk's iconic status as a command 'Mech with a good reputation. It presents a unique blend of traditional firepower with an experimental approach to durability, making it a potential game-changer on the battlefield for units that can adapt to its strengths and limitations.</p>",
    "manufacturer": "Norse-Storm Technologies, Inc",
    "primaryFactory": "Loxley",
    "systemManufacturer": {
      "CHASSIS": "Norse Heavy XTI-4C",
      "ENGINE": "Vlar 300 Light",
      "ARMOR": "ArcShield Heavy Type K",
      "COMMUNICATIONS": "Tek BattleCom",
      "TARGETING": "DLK Type Phased Array Sensor System"
    }
  },
  "mulId": 3221,
  "role": "Sniper",
  "source": "TR:3058U"
}