{
  "id": "vindicator-vnd-5l",
  "chassis": "Vindicator",
  "model": "VND-5L",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "CLAN_INVASION",
  "year": 3060,
  "tonnage": 45,
  "engine": {
    "type": "FUSION",
    "rating": 180
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 14,
      "RIGHT_ARM": 14,
      "LEFT_TORSO": {
        "front": 16,
        "rear": 6
      },
      "RIGHT_TORSO": {
        "front": 16,
        "rear": 6
      },
      "CENTER_TORSO": {
        "front": 20,
        "rear": 7
      },
      "HEAD": 9,
      "LEFT_LEG": 22,
      "RIGHT_LEG": 22
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 10
  },
  "movement": {
    "walk": 4,
    "jump": 4
  },
  "equipment": [
    {
      "id": "1-iserppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "1-isermediumlaser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-issmallpulselaser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "1-isermediumlaser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-ismediumpulselaser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-issmalllaser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "1-sword",
      "location": "LEFT_ARM"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Sword",
      "Sword",
      "Sword",
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISERMediumLaser",
      "ISMediumPulseLaser",
      "ISSmallLaser",
      "Triple Strength Myomer",
      "Triple Strength Myomer",
      "Triple Strength Myomer",
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISDouble Heat Sink",
      "ISERMediumLaser",
      "ISMediumPulseLaser",
      "ISSmallPulseLaser",
      "Triple Strength Myomer",
      "Triple Strength Myomer",
      "Triple Strength Myomer",
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Engine",
      "Engine",
      "Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Engine",
      "Engine",
      "Engine",
      "Jump Jet",
      "Jump Jet"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Jump Jet",
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Jump Jet",
      null
    ]
  },
  "quirks": [
    "rugged_1",
    "difficult_eject"
  ],
  "fluff": {
    "overview": "The Vindicator is one of the most well-known Capellan Confederation BattleMechs. This workhorse of the CCAF was built in 2826 between the First and Second Succession War to maximize the effectiveness of the Confederation's surviving production capabilities and fulfill as many roles as possible.",
    "capabilities": "The 'Mech has a top speed of only 64.8 km/h, which allows it to keep up with most heavy 'Mechs and some slower medium 'Mechs. Four jump jets give it a jumping capability of up to 120 meters that, while not up to par with the greater distances of 'Mechs like the Phoenix Hawk, allows the Vindicator the ability to outmaneuver most heavier 'Mechs, as well as making it easier to traverse rough terrain. It also carries more armor than the Phoenix Hawk with good overall coverage, particularly on its rear torso and legs, making it better protected than smaller 'Mechs. Armament for the 'Mech is adequate though its primary weapons are unsuited for point-blank ranges, while sixteen heat sinks help keep it cool.",
    "history": "Designed by committee, the Vindicator's \"jack-of-all-trades\" nature means it does not excel in any one role but fulfills them adequately. With almost all of its components produced on Capella, the Vindicator is also cheap, easy to mass produce, and quick to repair with a ready supply of spare parts. Unfortunately, early models of the Vindicator suffered from a design flaw wherein the head-mounted laser created a bulge in the cockpit. More than making the space cramped for tall MechWarriors, it also interfered with the ejection propulsion system, resulting in the deaths of a number of MechWarriors when their ejection seats exploded during ejection. Engineers managed to redesign the cockpit layout prior to the War of 3039, eliminating the deadly intrusion and decreasing the chance of said unfortunate malfunction. Due to its relatively lackluster design and the outrageous mark-ups on spare parts sold to out-of-state parties, the Vindicator has remained almost exclusive to the Capellan Confederation since its introduction. Even in the wake of the Fourth Succession War, with a good portion of their military complex and resources gone, the Capellan leadership continued funding production of this 'Mech and updated it with the rediscovery of lostech. Following the introduction of the Firestarter OmniMech and its spread by the Second Star League production of the Vindicator was curtailed, though the line would be partially revived with a couple of specialized variants in 3060.",
    "deployment": "The 5L variant is a more basic upgrade than the 4L and represents Ceres' attempt to produce a close-combat 'Mech superior to the FS9-0 Firestarter. Introduced in 3060 the 5L uses a standard engine, armor, and structure. The changes and advancements come in the weapons and a different system for augmenting its movement abilities, Triple Strength Myomer. The 'Mech's new weapons include an ER PPC, two ER medium lasers, two medium pulse lasers, a single Small Pulse Laser, and a small laser. This varied mix of energy weapons allows the MechWarrior piloting the 'Mech to balance their heat load to keep the Triple Strength Myomer working at its optimum efficiency. In so doing, the Vindicator can deal a fair amount of damage with its Sword.",
    "manufacturer": "Ceres Metals Industries",
    "primaryFactory": "Capella",
    "systemManufacturer": {
      "CHASSIS": "Ceresplex IV",
      "ENGINE": "GM 180",
      "ARMOR": "Starshield",
      "JUMPJET": "Anderson Propulsion 30",
      "COMMUNICATIONS": "CeresCom Model 21-Rs",
      "TARGETING": "C-Apple Churchill"
    }
  },
  "mulId": 3430,
  "role": "Skirmisher",
  "source": "TR:3050"
}