{
  "id": "jenner-jr7-a",
  "chassis": "Jenner",
  "model": "JR7-A",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "STANDARD",
  "era": "STAR_LEAGUE",
  "year": 2779,
  "tonnage": 35,
  "engine": {
    "type": "FUSION",
    "rating": 245
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 4,
      "RIGHT_ARM": 4,
      "LEFT_TORSO": {
        "front": 8,
        "rear": 4
      },
      "RIGHT_TORSO": {
        "front": 8,
        "rear": 4
      },
      "CENTER_TORSO": {
        "front": 10,
        "rear": 3
      },
      "HEAD": 7,
      "LEFT_LEG": 6,
      "RIGHT_LEG": 6
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 12
  },
  "movement": {
    "walk": 7,
    "jump": 5
  },
  "equipment": [
    {
      "id": "large-laser",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "Jump Jet",
      "Jump Jet",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Jump Jet",
      "Jump Jet",
      "Large Laser",
      "Large Laser",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet",
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Heat Sink",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      null
    ]
  },
  "quirks": [
    "no_arms"
  ],
  "fluff": {
    "overview": "The Jenner became the standard light warhorse of the DCMS with the outbreak of the First Succession War, though its reputation would be forever tarnished following its role in the Kentares Massacre.",
    "capabilities": "Five Smithson Lifter jump jets, two in each side torso and one in the center torso gave it a jumping distance of 150 meters, while its 245-rated Magna fusion engine allowed for a top speed of over 118 km/h, making it faster than most other 'Mechs. A favorite tactic of Jenner lances was to gang up on larger 'Mechs and unleash a devastating alpha strike. One or two of the 'Mechs would be equipped with inferno rounds, so even if the enemy survived the first strike they were badly damaged and running hot, allowing the Jenners to jump to safety and cool down themselves. A few seconds later the attack would be repeated until finally, the enemy was dead. It was also common practice to pair the Jenner with another Combine 'Mech, the Panther, creating a deadly combination of sheer speed and firepower with the slower Panther provided cover fire for the Jenner's flanking attack. The Jenner was such a favorite among Kurita MechWarriors that it became the benchmark against which all other newly designed Combine 'Mechs were compared.",
    "history": "Construction of new Jenners continued at Diplan MechYard's factory on Ozawa until a raw mineral shortage caused a halt in 2815, though they continued to produce new chassis. In 2823 production resumed on Ozawa, with some three thousand chassis shipped to Diplan's subsidiary on Luthien for final assembly, which itself was retooling to begin full-scale production; by 2830 both production lines were producing 1,350 Jenners a year. The sheer destruction of the Succession Wars finally took their toll when the last Jenner factory was destroyed in 2848, though so many Jenners had been produced by then that nearly every DCMS battalion had at least one of these 'Mechs well into the War of 3039. While the other Successor States eventually managed to procure operational Jenners (every AFFS regiment along the Combine border had at least one), the design remained in predominant use by House Kurita.",
    "deployment": "Early Star League-era version, replaced all other weapons with one Large Laser.",
    "manufacturer": "Luthien Armor Works, Diplan 'Mechyards, Luthien Armor Works, Luthien Armor Works, Diplan 'Mechyards",
    "primaryFactory": "Luthien, Abiy Adi, New Samarkand, Ozawa",
    "systemManufacturer": {
      "CHASSIS": "Diplan Scout-A",
      "ENGINE": "Magna 245",
      "ARMOR": "Starshield",
      "JUMPJET": "Smithson Lifters",
      "COMMUNICATIONS": "Dawson III",
      "TARGETING": "Bk-309"
    }
  },
  "mulId": 1687,
  "role": "Scout",
  "source": "TR:3039"
}