{
  "id": "victor-vtr-9b-shoji",
  "chassis": "Victor",
  "model": "VTR-9B (Shoji)",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "UNOFFICIAL",
  "era": "STAR_LEAGUE",
  "year": 2725,
  "tonnage": 80,
  "engine": {
    "type": "FUSION",
    "rating": 320
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 26,
      "RIGHT_ARM": 26,
      "LEFT_TORSO": {
        "front": 27,
        "rear": 7
      },
      "RIGHT_TORSO": {
        "front": 27,
        "rear": 7
      },
      "CENTER_TORSO": {
        "front": 39,
        "rear": 11
      },
      "HEAD": 9,
      "LEFT_LEG": 34,
      "RIGHT_LEG": 34
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 10
  },
  "movement": {
    "walk": 4,
    "jump": 4
  },
  "equipment": [
    {
      "id": "srm-4",
      "location": "LEFT_TORSO"
    },
    {
      "id": "ac-10",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-pulse-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "medium-pulse-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "medium-pulse-laser",
      "location": "LEFT_ARM"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISMediumPulseLaser",
      "ISMediumPulseLaser",
      "ISMediumPulseLaser",
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "SRM 4",
      "IS Ammo SRM-4",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "IS Ammo AC/10",
      "IS Ammo AC/10",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet",
      "Jump Jet"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Jump Jet",
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Jump Jet",
      null
    ]
  },
  "quirks": [
    "rugged_1"
  ],
  "fluff": {
    "overview": "The Victor was built in 2508 under contract to the Terran Hegemony as a support 'Mech with jump capabilities.",
    "capabilities": "Standing at 14 meters tall, the Victor approaches the concept of support in an unorthodox way for a 'Mech of its weight class. While only possessing a ground speed of 64.8 km/h, the Victor achieves a high degree of mobility instead through the use of four jump jets, allowing it to jump up to one hundred and twenty meters. A Victor can therefore \"support\" friendly units by jumping directly into the fray and bringing its deadly close range arsenal to bear, an ability which can surprise inexperienced MechWarriors and prove advantageous in mountainous terrain. One sacrifice made for this superb mobility is the 'Mech's relatively light armor of only eleven and a half tons, while the lack of proper anti-infantry capabilities is a minor problem.",
    "history": "An estimated one thousand Victors had been produced by the time the Star League fell. Many of these left with Aleksandr Kerensky during the Exodus, and when HildCo Interplanetary's three Victor factories were destroyed during the First Succession War, the 'Mech became a prized target with all sides scrambling to salvage serviceable units. Only Independence Weaponry retained the ability to build new Victors, and with their capture by the Federated Suns during the Second Succession War it became the AFFS' primary assault 'Mech and a favorite command model for battalion and regimental commanders. Though the Draconis Combine would eventually retake the company following the War of 3039, most Kurita samurai were too proud to adopt a 'Mech now associated with their enemy, while the Davions made do with purchasing new models from the rebuilt HildCo factory in the St. Ives Compact and funding the construction of Styk's Tao MechWorks. By the time of the Clan Invasion new models of Victors were being produced which incorporated new-found lostech into their design. The formation of the Second Star League and destruction of Clan Smoke Jaguar would finally win the design acceptance by Combine warriors, while the conquest of Styk and St. Ives by the Capellan Confederation forced the Federated Commonwealth to contract General Motors to build more Victors. Though it had officially fallen out of favor, during the FedCom Civil War the Victor remained the favorite of Allied forces, with newer variants seeing use in the years afterwards",
    "deployment": "Used by the 5th Benjamin Regulars commander on Royal during the War of Davion Succession, this Victor-9B variant removes the AC/20 and replaces it with an AC/10 and two more tons of ammo. The Medium Lasers have been removed and replaced with three Medium Pulse Lasers. The Victor variant is equipped with ten Double Heat sinks, and the remaining tonnage has been devoted to additional armor.",
    "manufacturer": "HildCo Interplanetary, HildCo Interplanetary, General Motors/Blackwell Corporation, Independence Weaponry, Robinson Standard BattleWorks, Tao 'Mechworks, TharHes Industries",
    "primaryFactory": "St. Ives, Carver V/Liberty, New Valencia, Quentin, Robinson, Styk, Tharkad",
    "systemManufacturer": {
      "CHASSIS": "HildCo Type V",
      "ENGINE": "Pitban 340",
      "ARMOR": "Durallex Heavy",
      "JUMPJET": "HildCo Model 12",
      "COMMUNICATIONS": "Opus III Highbeam",
      "TARGETING": "MaLandry 34"
    }
  },
  "mulId": 5864,
  "role": "Skirmisher",
  "source": "ER:2750"
}