{
  "id": "banshee-bnc-12s",
  "chassis": "Banshee",
  "model": "BNC-12S",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "MIXED",
  "rulesLevel": "ADVANCED",
  "era": "DARK_AGE",
  "year": 3138,
  "tonnage": 95,
  "engine": {
    "type": "CLAN_XL",
    "rating": 380
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "ENDO_STEEL"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 32,
      "RIGHT_ARM": 32,
      "LEFT_TORSO": {
        "front": 30,
        "rear": 10
      },
      "RIGHT_TORSO": {
        "front": 30,
        "rear": 10
      },
      "CENTER_TORSO": {
        "front": 44,
        "rear": 15
      },
      "HEAD": 9,
      "LEFT_LEG": 38,
      "RIGHT_LEG": 38
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 14
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "er-ppc",
      "location": "LEFT_ARM"
    },
    {
      "id": "gauss-rifle",
      "location": "LEFT_TORSO"
    },
    {
      "id": "er-ppc",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "srm-6",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "er-medium-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "er-medium-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "er-medium-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "er-medium-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "er-small-laser",
      "location": "CENTER_TORSO"
    },
    {
      "id": "er-small-laser",
      "location": "HEAD"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      null,
      null
    ],
    "LEFT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "ISGaussRifle",
      "IS Ammo SRM-6",
      "ISCASE",
      "IS Endo Steel"
    ],
    "RIGHT_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "SRM 6",
      "SRM 6",
      "CLERMediumLaser",
      "CLERMediumLaser",
      "CLERMediumLaser",
      "CLERMediumLaser",
      "IS Endo Steel"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "CLERSmallLaser",
      "IS Endo Steel"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "CLERSmallLaser",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Gauss Ammo",
      "IS Gauss Ammo"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Endo Steel",
      "IS Endo Steel"
    ]
  },
  "quirks": [
    "rugged_1",
    "bad_rep_is"
  ],
  "fluff": {
    "overview": "The Banshee, introduced in 2445 by the Terran Hegemony, is a 'Mech that was designed specifically for close-assault operations during the early years of BattleMech warfare.",
    "capabilities": "A contemporary of the Mackie and Emperor, the Banshee is undeniably fast for one of the heaviest 'Mechs ever produced, and with fifteen tons of armor it is better protected than most other assault 'Mechs. However the use of a massive GM 380 fusion engine left little room for weaponry, and even at the time of its introduction the Banshee was considered undergunned compared to its privately-built competition. As critics noted, what use was impressive armor and mobility if a better-armed enemy could overwhelm and destroy it? The result was a mediocre 'Mech which even the lowly Rifleman could beat as long as it prevented the Banshee's mass from coming into play.",
    "history": "The Hegemony soldiered on though, producing five thousand Banshees in a decade before its poor combat performance finally forced them to stop production in 2455 and the 'Mech was relegated to training and militia units for the next few centuries. Even during the Succession Wars the 'Mech's poor reputation meant many commanders saw it as a liability rather than an asset; unless they were fighting on a backwater Periphery world or as part of a poorly-equipped outfit, most Banshees were placed in second-line reserves to provide fire support or fulfill the role of brawlers so that better-armed 'Mechs need not engage in hand-to-hand combat. In this way fully a third of the original Banshee production run remained operational by the dawn of the thirty-first century and could be found throughout the Inner Sphere and Periphery, with the lion's share residing within the Lyran Commonwealth. Though a few attempts had been made over the years to improve the Banshee, Defiance Industries was the first to produce a variant which markedly improved on the original and was suggested by many of its original critics. With help from the Federated Suns and access to blueprints from the original Hesperus II factories, the BNC-3S proved to be such a success the Lyrans began fielding them in front line units, surprising their enemies who ignored them to focus on \"real\" threats with thoroughly unexpected firepower. Under the Federated Commonwealth improvements would continue to be made, though not at the same priority level as other projects, and the much-improved BNC-5S was active in time to meet the Clan Invasion.",
    "deployment": "This Dark Age variant uses a Clan-spec XL engine to reach a top speed of 64 km/h. An Endo Steel skeleton is used to free weight. The left arm carries an ER PPC, the left torso carries a Gauss rifle, and the right torso carries an ER PPC and SRM-6. The SRM ammo and Gauss Rifle are in the left torso and are protected by CASE. Two tons of Gauss Rifle ammo is carried in the left leg. The remaining weapons (an ER Small Laser in the head and center torso and four ER medium lasers in the right torso) are built to Clan standards. Fourteen double heat sinks are fitted in the engine. The remaining weight is devoted to armor, providing vast amounts of protection.",
    "manufacturer": "Defiance Manufacturing Annex",
    "primaryFactory": "Kwangjong-ni",
    "systemManufacturer": {
      "CHASSIS": "Foundation",
      "ENGINE": "Edasich Motors",
      "ARMOR": "Longanecker",
      "COMMUNICATIONS": "Angst",
      "TARGETING": "Angst"
    }
  },
  "mulId": 8246,
  "role": "Brawler",
  "source": "RG17"
}