{
  "id": "crossbow-w",
  "chassis": "Crossbow",
  "model": "W",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "CLAN",
  "rulesLevel": "ADVANCED",
  "era": "DARK_AGE",
  "year": 3128,
  "tonnage": 65,
  "engine": {
    "type": "FUSION",
    "rating": 325
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 18,
      "RIGHT_ARM": 18,
      "LEFT_TORSO": {
        "front": 19,
        "rear": 9
      },
      "RIGHT_TORSO": {
        "front": 19,
        "rear": 9
      },
      "CENTER_TORSO": {
        "front": 26,
        "rear": 13
      },
      "HEAD": 9,
      "LEFT_LEG": 26,
      "RIGHT_LEG": 26
    }
  },
  "heatSinks": {
    "type": "DOUBLE_CLAN",
    "count": 11
  },
  "movement": {
    "walk": 5,
    "jump": 0
  },
  "equipment": [
    {
      "id": "improved-heavy-medium-laser",
      "location": "LEFT_ARM"
    },
    {
      "id": "lrm-10",
      "location": "LEFT_ARM"
    },
    {
      "id": "improved-heavy-medium-laser",
      "location": "RIGHT_ARM"
    },
    {
      "id": "lrm-10",
      "location": "RIGHT_ARM"
    },
    {
      "id": "er-ppc",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "CLImprovedMediumHeavyLaser (OMNIPOD)",
      "CLImprovedMediumHeavyLaser (OMNIPOD)",
      "CLLRM10 (OMNIPOD)",
      "Clan Ammo LRM-10 (OMNIPOD)",
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "CLImprovedMediumHeavyLaser (OMNIPOD)",
      "CLImprovedMediumHeavyLaser (OMNIPOD)",
      "CLLRM10 (OMNIPOD)",
      "Clan Ammo LRM-10 (OMNIPOD)",
      null,
      null,
      null,
      null,
      null
    ],
    "LEFT_TORSO": [
      "CLDoubleHeatSink (OMNIPOD)",
      "CLDoubleHeatSink (OMNIPOD)",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "CLERPPC (OMNIPOD)",
      "CLERPPC (OMNIPOD)",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      null,
      null
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      null,
      null
    ]
  },
  "fluff": {
    "overview": "Developed during the Golden Century by Clan Steel Viper as an early second-generation OmniMech, the Crossbow is a relatively cheap OmniMech.",
    "capabilities": "Often described as a sleeker version of the Star League Longbow, the Crossbow is solidly protected by twelve tons of armor, though its traditionally missile-heavy weapons loadout means that it does not need any extra double heat sinks.",
    "history": "The Crossbow was Clan Steel Viper's first attempt to crash-start their OmniMech manufacturing capability, and was initiated in part by a small cadre of captured Clan Snow Raven scientist caste. Since both parties were relatively new to Omni-technology, the teams developed a novel Omni-pod system confined to replacing the 'Mech's arms. Since only the arms of early Crossbows can mount Omni-pods, early Crossbows are jump-incapable(more recently, configurations have been published containing weapon systems in the torsos). As the Crossbow is much less flexible than most OmniMechs, and since the Crossbow lacks of lighter materials of most OmniMechs, the Crossbow has largely been relegated to second-line duty, though it still appears frequently in the front lines, especially within Clan Steel Viper. However, the Crossbow is still quite effective - from its first engagement at Firebase Climax on Homer in 2870 to the present, the Crossbow's mix of arm-mounted missiles make it a superb fire-support choice. Considered a rare design by the Jihad era, the Crossbow's remaining production facilities would end up being destroyed in 3074 during the Wars of Reaving, effectively phasing it out of use in the Clan Homeworlds. The Crossbow would find new life in the Inner Sphere during the next century, as Clan Wolf used Arcturus' factories to mass-produce the design when they took the planet in 3128. During that battle a Wolf MechWarrior named Andreas managed to destroy an entire company of Lyran 'Mechs while piloting a Crossbow, earning a posthumous place in the Remembrance and ensuring that the newly-won factory would produce more of the design. Sporting an upgraded configuration Crossbows saw extensive use in the Clan Wolf touman, notably with the Seventy-ninth Wolf Battle Cluster on Denebola. When the Jade Falcons later claimed Arcturus after it was abandoned by the Wolves, they neglected the Crossbow's production lines, allowing Clan Sea Fox to buy and sell the design in large numbers. In Jade Falcon service Crossbows were used to less effect, partly because they were relegated to inferior units.",
    "deployment": "This variant mounts an LRM-10 with a ton of ammunition and an Improved Heavy Medium Laser in the arms, supplemented by an ER PPC in the right torso. An extra double heat sink is carried, bringing the total to eleven.",
    "manufacturer": "Novy Minsky Armaments Plant",
    "primaryFactory": "New Kent",
    "systemManufacturer": {
      "CHASSIS": "Anaconda OmniHeavy",
      "ENGINE": "New Kent Type 325",
      "ARMOR": "Compound V6",
      "COMMUNICATIONS": "Bishop 211 Meridian",
      "TARGETING": "Spanke 112-A"
    }
  },
  "mulId": 8238,
  "role": "Sniper",
  "source": "RG17"
}