{
  "id": "hatamoto-kaze-htm-27v2",
  "chassis": "Hatamoto-Kaze",
  "model": "HTM-27V2",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "ADVANCED",
  "era": "DARK_AGE",
  "year": 3115,
  "tonnage": 80,
  "engine": {
    "type": "FUSION",
    "rating": 320
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "ENDO_STEEL"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 26,
      "RIGHT_ARM": 26,
      "LEFT_TORSO": {
        "front": 25,
        "rear": 9
      },
      "RIGHT_TORSO": {
        "front": 25,
        "rear": 9
      },
      "CENTER_TORSO": {
        "front": 34,
        "rear": 16
      },
      "HEAD": 9,
      "LEFT_LEG": 34,
      "RIGHT_LEG": 34
    }
  },
  "heatSinks": {
    "type": "DOUBLE",
    "count": 17
  },
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "equipment": [
    {
      "id": "er-ppc",
      "location": "LEFT_ARM"
    },
    {
      "id": "er-ppc",
      "location": "RIGHT_ARM"
    },
    {
      "id": "mml-5",
      "location": "LEFT_TORSO"
    },
    {
      "id": "mml-5",
      "location": "RIGHT_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC"
    ],
    "LEFT_TORSO": [
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISMML5",
      "ISMML5",
      "ISMML5",
      "IS Ammo MML-5 LRM",
      "ISCASE",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel"
    ],
    "RIGHT_TORSO": [
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISMML5",
      "ISMML5",
      "ISMML5",
      "IS Ammo MML-5 SRM",
      "ISCASE",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel",
      "IS Endo Steel"
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "IS Endo Steel",
      "IS Endo Steel"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "ISC3SlaveUnit",
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Endo Steel",
      "IS Endo Steel"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "IS Endo Steel",
      "IS Endo Steel"
    ]
  },
  "quirks": [
    "easy_maintain"
  ],
  "fluff": {
    "overview": "The Hatamoto-Series BattleMechs represent a pinnacle of strategic innovation within the Draconis Combine, marking a fusion of advanced Star League technology with existing Combine frameworks. The development of this series was initiated to leverage the influx of SLDF BattleMechs gifted by ComStar, focusing on reverse-engineering efforts that combined the strengths of the Thug with the Charger chassis. Spearheaded by the foresight of the future Coordinator of the Draconis Combine, this endeavor aimed to create a long-term technological advantage. Integrating advanced weaponry onto a robust and readily available chassis, the Hatamoto-Series stands as a significant achievement in military engineering, reflecting a progressive approach to Mech warfare.",
    "capabilities": "The Hatamoto-Series is characterized by its formidable balance of firepower and defensive capabilities. These Mechs are equipped with a diverse array of energy and missile weapons, enabling effective engagement at multiple ranges. Their considerable armor plating allows them to endure severe combat scenarios, solidifying their role as primary combat units. A key design focus of the Hatamoto-Series is the prioritization of armament strength and survivability, though this comes at the cost of limited heat management and reduced mobility. The series faces challenges in heat dissipation during high-intensity battles, necessitating strategic weapon use by pilots. Despite these constraints, the Hatamoto-Series remains a testament to the Draconis Combine's engineering acumen, blending lethal offensive power with robustness to fulfill various combat requirements effectively.",
    "history": "The Hatamoto-Chi's development and subsequent variants have played a pivotal role in the evolution of the Draconis Combine's military might. After the introduction of the HTM-26T and 27T models, the Hatamoto-Chi underwent a series of modifications, each tailored to specific tactical needs and technological advancements within the Combine. The HTM-27U, known as the Hatamoto-Hi, emerged as a response to the need for a more heat-efficient and close-combat capable Mech. The integration of Medium Pulse Lasers and an additional heat sink in the 27U variant made it a popular choice for MechWarriors engaging in more aggressive combat scenarios.<p>Similarly, the HTM-27V (Hatamoto-Kaze) and HTM-27W (Hatamoto-Ku) variants represented strategic shifts towards long-range and direct fire combat, respectively. The 27V's focus on missile weaponry and the 27W's implementation of an Autocannon/5 provided MechWarriors with greater versatility in battlefield engagements, enhancing the Hatamoto-Chi's adaptability across different combat situations.</p><p>The introduction of the HTM-28T marked a significant advancement, featuring ER PPCs and Streak SRM-6 launchers, and the inclusion of a C3 slave unit, signifying the Combine's growing emphasis on network-centric warfare. This variant was particularly notable for its improved jumping capability, enhancing the Mech's mobility on the battlefield.</p><p>As the Draconis Combine faced new challenges in the post-Clan Invasion era and beyond, the Hatamoto-Chi continued to evolve. The HTM-30S Hatamoto-Suna and HTM-30Z Hatamoto-Godai variants, with their advanced weapon systems and electronic warfare capabilities, showcased the Combine's response to the changing dynamics of interstellar warfare. The HTM-30Z, equipped for command roles, became a symbol of leadership and strategic command on the battlefield.</p><p>In conclusion, the Hatamoto-Chi's history is not just a tale of technological innovation but also a reflection of the Draconis Combine's strategic adaptability and cultural evolution in Mech warfare. Each variant of the Hatamoto-Chi has contributed to its legacy as a formidable and versatile warrior on the battlefields of the Inner Sphere.</p>",
    "deployment": "The HTM-27V2 variant, a modernized adaptation of the Hatamoto-Kaze, features Multi-Missile Launchers (MMLs) instead of the standard LRM-5 launchers, enhancing its flexibility in missile combat. Equipped with a C3 slave unit, it excels in coordinated battlefield operations, sharing targeting data and optimizing firing solutions with allied units. This model retains the characteristic resilience of the Hatamoto series, making it a versatile asset for long-range engagements and integrated mech tactics.",
    "manufacturer": "Maltex Corporation",
    "primaryFactory": "Unity",
    "systemManufacturer": {
      "CHASSIS": "Earthwerks VOL",
      "ENGINE": "Pitban 320",
      "ARMOR": "Mitchell Argon",
      "COMMUNICATIONS": "Colmax 90",
      "TARGETING": "Garret D2j"
    }
  },
  "mulId": 7926,
  "source": "RS:3150"
}